{
  "client": "EDF Trading - Graduate Scheme",
  "jobDescription": "Job Description\nRegister Your Interest - 2026 Placement Opportunities\nWant to help power the future?\nAt EDF Energy, we’re leading the UK’s journey to Net Zero – and we’re looking for bright, curious students to join us on placements in 2026.\n\nWhat’s on offer?\nPlacements and internships in:\n\nEngineering\nUX Design\nTechnology\nHR & Resourcing\nCommunications & Public Affairs\nQuality & Procurement\nProject Management\nNuclear Security\nWhether you’re into problem-solving, people, or projects, there’s a role here for you.\n\nWho can apply?\nStudents looking for a year-long placement starting in 2026\nStudying towards an undergraduate degree\nCurious, motivated, and excited to make a difference\nWhy join EDF?\nReal projects, real impact – not just “work experience”\nLearn from experts shaping the UK’s clean energy future\nDevelop skills, grow your network, and boost your CV\nWork in an inclusive, supportive environment\nRegister Your Interest\nApplications open in 2025 – but by registering now, you’ll get early updates and be first in line when roles go live.\n\nYour energy shapes the future. Start your journey with EDF.\n\n",
  "totalCandidates": 50,
  "candidates": [
    {
      "User": "1",
      "University": "University College London",
      "Course": "Finance",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527812/download/ca3af675-0a3a-45b0-930a-cf4f7e70b70f",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "This Commercial Graduate Programme is a structured two year opportunity that provides broad exposure to the energy commodities trading business through four six-month rotations in areas such as trading, market risk, analytics, quantitative risk, and origination. It combines hands-on experience on real business projects with structured technical and professional training while offering mentoring. I understand the role is designed to give graduates a solid foundation in how EDFT operates, deepen their knowledge of the energy markets, and allow them to explore different career paths within a fast-paced trading environment, while making meaningful contributions from day one.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it offers the opportunity to apply quantitative analysis in a practical and high impact way within the derivatives trading team.",
      "What is it about this Graduate position that stands out for you?": "I am particularly drawn to the structured graduate programme, which offers the chance to rotate across key commercial areas, gain hands-on exposure to trading and risk, and develop both technical and professional skills under the guidance of experienced mentors. This combination of real responsibility, training, and long-term career development makes EDF Trading an ideal environment for me"
    },
    {
      "User": "2",
      "University": "City, University of London",
      "Course": "Mathematics/Statistics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527800/download/63f2a8b6-0600-461b-a617-d259c4221f17",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "From the job description, I understand that the Programme is a structured two-year scheme designed to give graduates broad exposure to the energy markets and the trading floor. The programme involves four six-month rotations across key areas such as energy commodities trading, market risk, analytics, quantitative risk, and origination.\n\nThe purpose of these rotations is to build a strong foundation in the energy commodities sector while giving graduates practical, hands-on experience. This includes working on live projects, analysing data, supporting risk management, and contributing to trading and origination activities. The role combines quantitative and qualitative analysis with commercial awareness, and it requires critical thinking, adaptability, and collaboration within a fast-paced trading environment.\n\nI also understand that EDFT places strong emphasis on training and development, offering mentorship, skills training, and networking opportunities. By the end of the programme, graduates are well positioned to progress into permanent roles such as junior traders, analysts, or risk professionals, and to build long-term careers in the energy markets.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it combines the dynamism of a leading trading house with the long-term vision of the EDF Group, a global leader in low-carbon energy. The opportunity to contribute within an organisation that plays a central role in Europe’s power and gas markets, while also supporting the global transition to sustainable energy, is particularly compelling to me.\n\nWhat stands out about EDFT is the breadth of commodities it trades, which creates a unique platform for learning and developing commercial acumen. The Commercial Graduate Programme offers structured rotations across trading, market risk, analytics, and origination, which is exactly the type of exposure I am seeking early in my career. It would allow me to apply my quantitative skills in real business contexts, gain hands-on experience of risk management, and understand how trading decisions impact both the business and the wider market.\n\nEqually important, I value EDFT’s culture of collaboration, diversity, and innovation. I am drawn to the emphasis on curiosity, flexibility, and respect, which I believe creates an environment where I can both contribute and continue to grow.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this Graduate position is the unique combination of breadth and depth it offers. The rotational structure provides an exceptional opportunity to gain a 360-degree view of the energy trading business. I find this especially appealing because it allows graduates to explore different areas before specialising, while ensuring that every rotation contributes to building a solid foundation in the industry.\n\nThe chance to sit on a trading floor and work on live projects from day one is also compelling. Rather than being limited to observation, the programme emphasises hands-on involvement, interaction with commercial teams, and responsibility that can make a tangible impact. The emphasis on both technical skills and professional development, alongside mentoring and coaching, gives me confidence that I would be challenged and supported in equal measure.\n\nFinally, I value the global perspective of EDF Trading. With operations spanning Europe, Asia, and North America, this role offers the chance to build expertise in an international environment, while contributing to an organisation that plays a central role in both energy markets and the transition to low-carbon solutions."
    },
    {
      "User": "3",
      "University": "Imperial College London",
      "Course": "Finance",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527639/download/c58d3f90-a4df-4705-a8a8-f890ebfa0dc8",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding of the two year Commercial Graduate Programme at EDF Trading is that it is designed to give graduates broad exposure across the energy trading business through four six-month placements, in areas such as energy commodities trading, market risk, analytics, quant risk and origination. This structure will build a strong foundation across the energy markets as a whole, and allow the opportunity to explore different career paths within EDF Trading. \n\nWhile attending the EDF Trading event on Wednesday (with AmplifyME), what stood out about the role was the analysts’ views of the programme, where they highlighted that by the time you graduate from the programme, you will have a well rounded knowledge about how the analytics is carried out, how to manage risk, and understand all the players, and can therefore start to trade and have a real impact from day one.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because I want to contribute to the scale and impact of working for one of the world’s largest power traders, with the agility to adapt quickly to global geopolitical events. Having studied Physics, and now pursuing an MSc in Financial Technology, I’ve developed strong quantitative and coding skills, which are essential in EDFT’s analytics and trading teams. I thoroughly enjoyed the trading simulation at the insight event paired with AmplifyME, and what specifically interested me about energy trading was the adaptability required – I want to work in a dynamic and fast-paced role.\n\nAt the insight event on Wednesday, what resonated with me was how closely traders, analysts, risk and origination work together. I’m excited to join the rotational programme across these different teams, to deepen my skills specific to each team, and gain a wider commercial awareness of the energy sector.  Combined with EDFT’s flat structure and a culture of curiosity, respect and innovation, I see this as the ideal environment to contribute, learn from senior colleagues, and build a long-term career in energy trading.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me the most is the rotational structure of the programme. The chance to gain hands-on experience across trading, analytics, market risk and origination is a unique opportunity, as it’ll give me the opportunity to build on my technical skills – like quantitative analysis and coding – and develop my commercial understanding at the same time, so that I can contribute effectively from day one on a trading desk. \n\nI also value how closely integrated the teams are at EDF Trading. From the insight event, it was clear that all of the teams work side by side, which creates a culture of collaboration and continuous learning. The flat structure is particularly appealing because it creates an environment where graduates are encouraged to contribute ideas from the start. That level of exposure and responsibility us rare, and I believe it would accelerate both my learning and development. \n\nFinally, the scale of EDFT as one of the largest power traders in the world, combined with it’s agility to adapt to global shocks (like the Ukraine war and the pandemic), makes this an exciting place to build a career. I want to be part of an organisation that is not only shaping European energy markets, but also innovating at the forefront of the energy transition."
    },
    {
      "User": "4",
      "University": "Other",
      "Course": "Finance",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527559/download/61358573-e06b-4b65-b2a1-e7cb32a4bdf8",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "As a recent finance graduate with academic and extracurricular experience in quantitative finance, my understanding of the role is shaped by the rotations I aim to complete. In origination I would help develop new opportunities, structure transactions and monitor regulatory changes with commercial impact. In derivatives trading I would apply quantitative analysis and software tools to assess market exposure and support hedging strategies that optimise EDF’s assets. In gas trading I would work on portfolio analysis, pricing, logistics and storage optimisation while seeing how gas links with oil and FX markets. In power trading I would analyse flows, interconnector capacity and price differentials to identify opportunities and manage risk. Day to day this means using data, models and market insights to support trading decisions while working closely with teams across the business to create value for EDF and its customers.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it’s a place where I can combine my academic and practical experience in finance with my passion for markets and trading. During my studies, I grew a small portfolio of cryptocurrency to around $50k USD and sold just prior to China's 2021 ban on crypto transactions. I sold because there were strong indicators and leaks in the communities I was a part of that there was a ban coming soon. There was enough credible information for me to pull the trigger early which ended up being the right decision, selling at an 8 month high price that would not be seen again until much later that year. I really enjoyed doing due diligence on crypto in my spare time. It gave me hands-on experience in risk, strategy, and decision-making under pressure. It probably contributed to my less than perfect grades but I made real money and learned skills that weren't taught at uni. The positive reviews from interns highlighting the analytical and collaborative culture reinforce my view that EDF Trading is the right place to continue developing these skills and make an impact for the firm.",
      "What is it about this Graduate position that stands out for you?": "Rotating through both the trading and origination teams excites me because it combines the aspects of my degree and extracurriculars I most enjoyed. Analysing markets and responding to geopolitical developments in a fast-paced, hands-on environment sounds like a step up from what I love to do already at home and with the friends I made through the quant club. I want to find a graduate role that will allow me to build on my coding, trading, and modelling skills while learning brand new skills from much smarter people than me so EDF's Commercial graduate program sounds like a great fit. Thank you for considering my application. Kind regards, Aleks."
    },
    {
      "User": "5",
      "University": "University College London",
      "Course": "Computer Science and IT",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527496/download/87b91b2e-3c7a-46a8-90e2-24b6b34f7ae6",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "This is a rotational programme across several commercial functions, including trading and markets, digital channels, and customer strategy. It offers the chance to develop new skills alongside industry experts while gaining a broad understanding of EDF’s business and how different teams contribute to its overall success.",
      "Why do you want to work for EDF Trading?": "I recently took part in EDF’s virtual trading simulation, where I explored both energy trading and quant developer roles. I really enjoyed applying my analytical skills in a fast-paced environment and seeing how trading decisions are made. The experience also gave me an insight into the collaborative culture and the emphasis on continuous learning at EDF Trading, which further strengthened my motivation to join the team.",
      "What is it about this Graduate position that stands out for you?": "What excites me most about this graduate programme is the opportunity to rotate across different areas of the business, develop a wide range of skills, and gain exposure to multiple commercial functions. I’m particularly drawn to the chance to contribute to projects that not only enhance customer experience but also support the UK’s journey to Net Zero."
    },
    {
      "User": "6",
      "University": "St George's, University of London",
      "Course": "Finance",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527471/download/5e017510-0b92-474c-b2f7-621b069bbe0c",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "This is a two-year Commercial Graduate Programme at EDF designed to give broad exposure across the company’s commercial functions while contributing to the UK’s Net Zero goals. The programme is structured into four six-month rotations, where I would gain hands-on experience in areas such as trading and market analysis, digital channels, customer strategy, and project delivery.\n\nThe role combines analytical and customer-focused responsibilities. On one side, I would be analysing market trends, identifying risks and opportunities, and supporting trading decisions that feed into EDF’s wider commercial strategy. On the other hand, I would be helping to shape low-carbon solutions and projects that improve customer experience and business performance.\n\nIt’s also clear that EDF wants graduates to develop leadership skills and take on real responsibility early. I would be expected to collaborate with teams across the business, contribute to meaningful projects, and, in some cases, lead initiatives that align with EDF’s mission of providing clean, affordable, and secure energy.\nFinally, the role offers structured professional development with mentoring, training, and support. What stands out is EDF’s emphasis on innovation, inclusivity, and the idea that “Success is Personal,” which means I would be able to shape my career journey while making a tangible contribution to Britain’s energy transition.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it is one of the largest power and gas traders globally, offering exposure to markets and products that are central to the energy transition. Hearing about EDFT at the Amplify event reinforced my interest, as graduates spoke about the responsibility they were given from day one and the demanding yet rewarding culture. That is exactly the type of environment I want to be part of, one where high performance is expected and supported.\n\nI was also inspired by the CFO, Sylvie Billion, emphasising agility and a growth mindset as key to success at EDFT. These are qualities I have demonstrated myself, whether by teaching myself coding, developing advanced Excel skills, or pursuing a Master’s in Energy, Trade and Finance. I am constantly looking to grow, adapt and build new skills.\n\nFor me, EDF Trading represents an unparalleled opportunity to learn from some of the best in the industry, contribute to a leading player in power and gas markets, and develop the commercial skills and mindset needed to perform at the highest level.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this Graduate position is how much it nurtures curiosity and critical thinking. That really excites me, because I enjoy questioning, analysing and applying new ideas, and it seems that excellence in this environment is built on those traits. The opportunity to gain exposure to the power and gas markets is also a major draw. For example, hearing about the stack model or how marginal costs shape power prices really interested me and made me want to deepen my understanding further.\n\nI am also very motivated by the emphasis on problem-solving, which appears to be at the core of the programme. Alongside this, I have been developing my coding skills to a strong level, so the chance to bring those skills into real commercial situations on the graduate programme would be a fantastic opportunity."
    },
    {
      "User": "7",
      "University": "Other",
      "Course": "Mathematics/Statistics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527398/download/c63c9b80-b9be-455f-8448-2eaaca802b53",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "This role offers four rotations across trading, risk, and quantitative analytics which will help me build a solid foundation in energy markets. With my ALM/Treasury experience, I see it as a chance to apply my quantitative skills directly in a trading environment.",
      "Why do you want to work for EDF Trading?": "EDF is a leader in low carbon energy and a specialist in wholesale markets. I want to thrive in such an environment with diverse and high performing teams where I can use my quantitative background to support trading and risk decisions.",
      "What is it about this Graduate position that stands out for you?": "The rotational structure stands out, as it allows me to explore different areas before specialising. The mix of trading and quantitative rotations fits my background in ALM/Treasury and studies in quantitative finance. The strong mentoring and clear graduate career paths make it the ideal platform to launch my career in energy markets."
    },
    {
      "User": "8",
      "University": "Other",
      "Course": "Finance",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527344/download/fbd67ee4-8e08-4b79-b266-d5f52f18cef3",
      "Do you have the right to work in the UK?": "No",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "Based on the job description, I understand that the Commercial Graduate Programme at EDF Trading is a structured two-year programme designed to provide graduates with in-depth exposure to the energy trading industry. Through four six-month rotations, I would gain hands-on experience across key functions such as energy commodities trading, market risk, analytics, quant risk, and origination. This structure allows graduates to develop a strong foundation in the wholesale energy markets, working closely with commercial teams, building analytical and technical skills, and gaining insight into the dynamics of global energy markets. The programme is designed to cultivate critical thinking, commercial awareness, and technical expertise while offering continuous coaching, mentoring, and career development opportunities.",
      "Why do you want to work for EDF Trading?": "EDF Trading stands out as a world leader in wholesale energy markets and part of the EDF Group, a pioneer in low-carbon sustainable energy. What attracts me most is EDFT’s strong reputation in power, gas, and environmental products, coupled with its culture of innovation, diversity, and respect. The company’s ability to adapt to rapidly changing energy markets while maintaining trust from clients and stakeholders demonstrates a level of expertise and resilience that I aspire to be part of.\n\nI am motivated by the opportunity to contribute to EDFT’s mission of delivering value through efficient asset management, risk management, and trading expertise. EDFT’s global footprint and its integration into the EDF Group also provide exposure to international energy markets, enabling me to contribute to solutions that have a tangible impact on global sustainability. Furthermore, the firm’s emphasis on diversity, inclusion, and employee empowerment resonates with my own values, making EDFT not only a place to work but a place where I can grow personally and professionally.",
      "What is it about this Graduate position that stands out for you?": "What excites me most about this Graduate Programme is the unique opportunity to rotate across different business areas on the trading floor, gaining both breadth and depth of exposure in the energy markets. Unlike many graduate schemes that focus on a single department, EDFT’s rotational model offers a chance to explore multiple career paths, from trading to analytics, while building a comprehensive understanding of how the business operates.\n\nThe combination of hands-on project work, mentoring, and professional training creates a balance of practical learning and career development that I find particularly appealing. In addition, being part of a fast-paced and intellectually stimulating environment while learning directly from industry experts offers a challenging yet rewarding start to a career in energy trading. Most importantly, the opportunity to work in a global, dynamic, and forward-looking organization committed to shaping the future of sustainable energy is what truly makes this programme stand out for me."
    },
    {
      "User": "9",
      "University": "Imperial College London",
      "Course": "Physics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527243/download/f36f42fb-51e1-4b7a-baa5-7d9cd8e84042",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "This graduate role is designed to provide a comprehensive introduction to energy trading through structured rotations across trading, risk, analysis, and compliance. A core element is the shift desk, where graduates are trained to optimise EDF’s diverse generation portfolio in real time, making decisions under pressure and with imperfect information.",
      "Why do you want to work for EDF Trading?": "I am particularly drawn to EDF’s strong culture, which emphasises collaboration and continuous learning. The opportunity to work in an environment that combines academic rigour with teamwork is especially appealing, as it offers the chance to develop my skills while learning from experienced professionals. I value the idea of contributing within a supportive culture that encourages growth, innovation, and knowledge-sharing.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this role is the balance it strikes between technical challenge and commercial impact. The fast-paced nature of energy trading demands not only strong analytical and quantitative skills but also the ability to apply them with commercial awareness and adaptability. I find this combination particularly exciting, as it offers the chance to solve complex problems while making decisions that have immediate, real-world consequences in dynamic markets."
    },
    {
      "User": "10",
      "University": "Other",
      "Course": "Mathematics/Statistics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527135/download/eb1a1d04-7b5e-4c9e-a2bf-4dbbdf17ac3a",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding is that this Graduate role is about becoming directly involved in the commercial side of EDF Trading, gaining hands-on exposure to the wholesale energy markets. From day one, graduates are expected to contribute to trading, structuring, or risk activities — not just by observing, but by taking real responsibility.\n\nThe programme is designed to build both technical and commercial skills: on the one hand, analysing markets, modelling, and managing risk; and on the other, developing the ability to communicate insights, work collaboratively, and make decisions in a fast-paced environment.\n\nWhat also stands out is the international scope and innovative culture at EDF Trading — the role offers the chance to learn from experienced professionals while contributing to a business that plays a key part in the global energy transition",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it combines two things that really motivate me: being part of a global leader in energy trading, and contributing to a sector that is both fast-moving and essential for the energy transition. I’m attracted by the opportunity to gain responsibility from day one, learn from experienced professionals, and apply my quantitative and analytical skills to real trading challenges. EDF Trading’s innovative and collaborative culture makes it the ideal place for me to grow and build a career.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this Graduate Programme is the combination of early responsibility, direct exposure to wholesale energy markets, and the chance to learn from experienced professionals. I find it really motivating that EDF Trading trusts graduates to contribute to real commercial decisions from the start, while also giving us the opportunity to develop a broad set of skills across trading, structuring, and risk."
    },
    {
      "User": "11",
      "University": "Edinburgh, University of",
      "Course": "Computer Science and IT",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527102/download/842fc65c-d5a3-4ad8-be40-7f431b850ced",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding is that this role is a hands-on, rotational journey through EDF's commercial departments, with the ultimate goal of contributing to the UK's Net Zero ambitions. I would be actively involved in shaping the company's commercial strategy by analysing market trends and trading decisions. This responsibility extends to proactively identifying both risks and opportunities across various digital and customer channels. A significant part of the experience appears to be rooted in teamwork, as I would be collaborating with different teams to help deliver concrete low-carbon solutions for customers. I would also take on genuine responsibility by leading or supporting projects aimed at directly improving customer experience and overall business performance.",
      "Why do you want to work for EDF Trading?": "I am driven to work for EDF Trading because it provides the ideal environment to apply my quantitative skills to the complex and dynamic challenge of the energy markets. My passion for this field is demonstrated by my success in the IMC Prosperity trading competition, where my team placed in the top 2% globally by combining coding with strategic analysis to generate returns. This experience in a simulated market environment has prepared me to analyse trends and support commercial strategy at EDF.\n\n\nFurthermore, I have developed the specific technical skills required for such a role through projects like my gold price prediction analysis, where I applied machine learning techniques and effectively preprocessed data to outperform baseline models. My coursework in Reinforcement Learning at Cornell University has also given me a theoretical foundation in advanced methods for optimizing trading decisions. I am eager to apply this background to contribute to EDF’s mission of achieving Net Zero, using data-driven insights to navigate the energy transition.",
      "What is it about this Graduate position that stands out for you?": "What stands out most is the structured, two-year rotational format, which offers hands-on experience across a range of commercial functions including trading and market analysis. This is particularly appealing as it provides a direct opportunity to build upon my experience in designing trading algorithms and using machine learning techniques to predict price movements. The opportunity to rotate through different areas, from customer strategy to market analysis , aligns perfectly with my cross-disciplinary background in Cognitive Science and my experience using Python to analyse large datasets for non-technical stakeholders. Furthermore, I am drawn to the chance to take on real responsibility and contribute to meaningful projects that support the UK’s Net Zero goals. Having led a team to second place in a quantitative trading challenge and developed predictive models in a professional internship , I am eager to apply these analytical and collaborative skills to help deliver low-carbon solutions for customers."
    },
    {
      "User": "12",
      "University": "Imperial College London",
      "Course": "Aeronautical Engineering",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527085/download/986c6e0e-e1ab-4fab-a894-23cd06a42a70",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The role includes a 2-year rotational programme across teams within the trading floor. During this time there will be opportunities to work on real impactful projects, learn new skills and understand how all the divisions work together. Through the programme, I will gain valuable exposure to risk management and analytics, deepening my understanding of the energy markets. If the opportunity arises after the programme, I hope to apply these skills as a trader while continuing to build a strong global network within EDFT.\n\nThrough these rotations, I would also gain exposure to both physical and financial energy markets and develop a deep understanding of how EDFT operates as a gateway for buyers and sellers of commodities like power, gas, LNG, LPG, oil, and environmental products.  \n\nThe programme also includes structured training, continuous mentoring, and skills development, helping me strengthen my quantitative, analytical, and programming skills while learning to think critically and identify commercial opportunities.\n\nOverall, I see this role as a unique opportunity to combine analytical and commercial thinking, contribute to EDFT’s goal of optimising energy assets and risk management, and explore potential long-term career paths such as trading, analytics, or market risk.",
      "Why do you want to work for EDF Trading?": "I first became interested in commodities during my Trading Academy at Flow Traders, where I was introduced to how commodity markets operate. This interest grew further during my summer internship at Morgan Stanley, where commodities ended up being my favourite rotation.\n\nI learnt about EDF Trading through the AmplifyME simulation, which gave me a great insight into the fast-paced and collaborative nature of energy trading. Listening to John Grey speak about his journey from mechanical engineering to trading was particularly inspiring, as his background is very similar to mine (Aeronautical Engineering). I also noticed that many graduates at EDFT come from diverse academic and cultural backgrounds, which I believe makes the workplace stronger and more innovative. Seeing senior women leaders such as Sylvie Billion was especially inspiring, and as President of Women in Trading at Imperial, diversity and inclusion are values I strongly champion.\n\nOne of my friends interned at JERA Global Markets and had an amazing experience. Knowing that EDF Trading is a one-third shareholder in JERA Global Markets, a leading utility-backed seaborne energy trader managing one of the largest LNG portfolios globally, makes me excited about the global exposure and learning opportunities I would gain here.\n\nFinally, I am passionate about sustainability. Last year I took a module on technologies to combat climate change, and next year I will be taking “Quantification of Aerospace Environmental Impact,” taught by an MIT professor. EDF’s mission to build a resilient electricity system and support the global transition to net zero by 2050 strongly resonates with me, and I would love to get involved and contribute to this goal while developing as a future trader.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me most is the mentorship programme and the opportunity to rotate across different areas of the trading floor. I believe that to become a strong trader, it’s essential to understand all aspects of the business, from risk and analytics to origination and trading, and this programme gives me exactly that exposure.\n\nI am also drawn to the chance to learn from so many experienced people, grow my network, and build strong bonds within the EDFT community. The collaborative culture described in the job description makes this programme not just about technical development, but also about becoming part of a supportive and inspiring team."
    },
    {
      "User": "13",
      "University": "Reading, University of",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527077/download/42226753-9577-407c-bab9-19bd3f8600b7",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "I see this as a two year graduate role that will allow me to explore all aspects of the trading floor while developing and utilising essential skills that will help to me solve complex and rewarding challenges in a fast pace environment which will lead onto a flourishing career within the business.",
      "Why do you want to work for EDF Trading?": "My initial interest in the role was sparked by a job simulation that I undertook with amplify me which gave me an insight into the role and the company as a whole as well as giving me the chance to meet some of the staff . After this through further research into the company and role I only became more and more interested in working for EDF Trading .",
      "What is it about this Graduate position that stands out for you?": "I think this graduate position stands particularly unique in it's length at two years which allows for the rotation around the different divisions within the business , which not only allows me to understand all the different roles of people I will be dealing with but also allows me to experience each individual division to make sure that it's the right division for me ."
    },
    {
      "User": "14",
      "University": "Anglia Ruskin University",
      "Course": "Accountancy",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527055/download/124d0149-1f63-4e2e-bdc1-4c0077392a8b",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "Test",
      "Why do you want to work for EDF Trading?": "Test",
      "What is it about this Graduate position that stands out for you?": "Test"
    },
    {
      "User": "15",
      "University": "Bath, University of",
      "Course": "Accountancy",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527005/download/25026b31-ea2a-4ebe-bf50-baa89dda857b",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding is that the Commercial Graduate Programme is a structured, two-year immersion designed to build a comprehensive and practical foundation in the wholesale energy markets. The programme’s core is its rotational structure, which provides hands-on experience across the entire trading floor through four distinct six-month placements.\n\nBased on the description, these rotations in areas like Energy Commodities Trading, Analytics, Market Risk, and Origination are designed to show how these functions interlink. For example, the work in Analytics directly informs the strategies developed on the trading desks, while Market Risk provides the essential framework for managing the resulting positions.\n\nCrucially, I understand the ultimate objective of this role is to learn how to apply strong analytical and quantitative skills to add value to the assets of the EDF Group. This means it’s not just about theoretical trading, but about understanding how to optimise a vast portfolio of physical, low-carbon assets in real-time. Therefore, I see the role as a development path towards becoming a commercially astute professional who can identify opportunities and manage risk to contribute directly to EDFT's success.",
      "Why do you want to work for EDF Trading?": "My interest in EDF Trading was solidified after hearing from a current graduate, Mithesh Duddekunta, during my AmplifyME programme. He provided a compelling, first-hand account of the firm's culture, emphasising the significant level of responsibility given to graduates and the open, collaborative environment. His description of working directly with senior traders on meaningful projects brought to life the job description's promise of a culture where employees are encouraged to speak up and their contributions are genuinely valued. It became clear that EDFT is a meritocracy where learning and making a direct impact are prioritized from day one.\n\nThis cultural aspect, combined with EDFT's position as a premier asset-backed trader, is what truly sets the firm apart for me. The opportunity to work directly with the physical assets of the EDF Group, a global leader in low-carbon energy, provides a tangible, fundamental grounding that cannot be replicated at a purely financial institution. It makes the analytical challenge of the work directly connected to real-world outcomes.\n\nFinally, the firm's central role in the energy transition adds a layer of purpose to the commercial challenge. Hearing how these elements combine in practice from Mithesh demonstrated that EDFT offers the ideal environment to not only learn the complexities of energy markets but also to make a meaningful contribution from day one.",
      "What is it about this Graduate position that stands out for you?": "What stands out most is the programme's structure, specifically the four distinct six-month rotations across the core functions of the trading floor. This design offers a breadth and depth of experience that is truly exceptional. Rather than just gaining siloed knowledge, this structure provides a holistic, 360-degree understanding of how a trading desk operates. It offers clear insight into how the analysis from the Analytics team directly informs a trader's strategy, while the Market Risk function provides the essential guardrails for that execution.\nFurthermore, the emphasis on hands-on real business projects combined with continuous coaching from your manager and mentor is a powerful combination. It signals that this is not a passive learning experience, but a genuine apprenticeship where graduates are expected to contribute meaningfully while receiving the dedicated support necessary to succeed and grow.\nFinally, the fact that the programme has a clear and proven track record of developing graduates into key roles such as junior traders and analysts is a significant differentiator. It shows that this is a long-term investment in talent, offering a tangible and exciting career path, not just a two-year position."
    },
    {
      "User": "16",
      "University": "London School of Economics and Political Science",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/527044/download/5a541e26-adcb-416b-89ca-bc4b58b4444e",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "From my understanding, the graduate programme at EDF Trading offers a unique and dynamic opportunity to gain hands-on experience in energy markets, specifically within a leading organisation in the European power and gas sectors. This role stands out to me as it not only allows for practical involvement in commodities trading but also provides structured training that will deepen my knowledge of the industry and refine my professional skills.\n\nI am particularly excited about the opportunity to work on real projects that will allow me to contribute meaningfully while learning from experienced teams. The programme's strong focus on mentorship and regular feedback is appealing, as it will enable me to grow and continuously improve. I value that EDFT emphasises collaboration and inclusivity, and I believe this culture will empower me to reach my potential.\n\nThe opportunity to interact with commercial teams and leaders globally is also compelling, as it will help me build valuable industry connections and enhance my understanding of the commercial side of energy trading.\n\nWith my interest in the energy sector and analytical mindset, I am enthusiastic about the possibility of contributing to and growing within EDFT’s innovative environment.",
      "Why do you want to work for EDF Trading?": "Through researching EDF Trading, I hear of the vital, positive culture; and flat hierarchy in which decisions are driven by collective consensus. Having experienced a similar environment at Bernstein, where I have been actively involved in the research process and have expressed my opinions as an intern, I can appreciate the benefits of promoting an inclusive, collaborative and diverse working environment.\n\nThe position EDF Trading occupies in the market is unmatched and therefore fosters a resilient and progressive environment to learn and develop. Further, the energy markets are of real interest to me. During my time at Bernstein, I was fascinated by the Oil & Gas team's coverage of Europe's largest energy players. Although the analysis of the companies themselves was interesting, it was the industrial trends I found exciting. Following the recent news where the OPEC+ nations announced they would increase crude supply, I was genuinely excited to see its impact in the markets the next day at work. This experience instilled confidence of my interest in commodity markets and trading, but energy products like oil and gas.\n\nFurther, EDFT's leading position in low-carbon energy trading, through products like nuclear and other renewables is invigorating. During my studies of physics at A-level, I thoroughly enjoyed learning about nuclear power and appreciate its feasibility debate in today's world, like many other renewable energy sources.\n\nIn summary, the inclusive and collaborative environment at EDFT allied to its industry leading position and research, is what attracts me so strongly to the firm.",
      "What is it about this Graduate position that stands out for you?": "This graduate position at EDF Trading stands out to me as it provides a rare opportunity to gain firsthand experience in the highly dynamic and impactful energy trading industry. This exposure alone is appealing, but to at a company like EDF which operates at the forefront of the energy markets elevates the programme further. The structured programme offers not only hands-on project involvement but also continuous training in industry-specific and professional skills, which I see as a great platform to accelerate my understanding of the energy markets and build essential skills for a career in this industry.\n\nI’m particularly drawn to EDFT’s commitment to both innovation and diversity. Working in an environment that values respect and collaboration, while also encouraging flexibility and adaptability, resonates with me as it aligns with my values and how I see myself contributing in a professional setting. The chance to work directly with skilled professionals, engage in high-impact projects, and receive mentorship from leaders in the field is truly compelling.\n\nThe breadth of roles available across trading also appeals to me, as it allows for the exploration of multiple areas within the energy trading domain. I understand that interns were able to present to management at the end of their internships which further demonstrates EDFT’s commitment to meaningful, results-driven work, which is both motivating and exciting.\n\nOverall, the combination of markets exposure, skill development, and a collaborative, supportive culture makes this graduate programme a unique and valuable opportunity to start a career in energy markets."
    },
    {
      "User": "17",
      "University": "Other",
      "Course": "Accountancy",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526926/download/6f6c2145-e5fd-4b3c-a8a3-b5cd37be04d7",
      "Do you have the right to work in the UK?": "No",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "EDF provides full range of optimization, risk management and trading services for wholesale energy markets.",
      "Why do you want to work for EDF Trading?": "EDF trading will expose me to high profile deals and I will get the chance to work with top-notch professionals from the company which will enable me to develop my skills.",
      "What is it about this Graduate position that stands out for you?": "This graduate position is an opportunity for me to network with professionals and learn more from them."
    },
    {
      "User": "18",
      "University": "Warwick Business School",
      "Course": "Finance",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526900/download/e915dd33-4c6f-4124-bc2a-6185ceb95cc2",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "It is a two-year commercial programme with four rotations of roughly six months across trading, analytics and risk, and client origination. You learn how EDF Trading prices and hedges power, gas, LNG and environmental products, how asset optionality is managed, and how client solutions are structured. Day to day that means turning market information into clear views, helping optimise positions around risk limits, and supporting origination with analysis that clients can rely on. The set-up naturally develops collaboration because you move between desks and learn the common language of risk and P&L. It also demands excellence and trust since your work feeds live decisions, and adaptability because markets move quickly and client needs vary. The entrepreneurial part is spotting useful angles in the data and shaping ideas that create value for EDF and for clients.",
      "Why do you want to work for EDF Trading?": "The attraction is an asset-backed platform where commercial judgment is grounded in real flows and client outcomes. That matches how I like to work. At Tradeview Capital I built investment models for live decisions and, with a co-intern, cleaned inconsistent market data so our inputs were reliable. At PwC I ran scenario analysis on a 26-entity restructuring and delivered under tight deadlines. As M1 Volleyball Manager I aligned a diverse squad around KPIs and secured funding. Those experiences taught me to work across teams, protect decision quality, and take ownership for results, which is how EDF Trading describes its culture in practice. I want to bring that mindset to a place where collaboration is expected, trust is earned through clean analysis and consistent delivery, and excellence shows up in how clients are served.",
      "What is it about this Graduate position that stands out for you?": "The combination of trading-floor exposure, client-facing origination, and structured rotations stands out. I want to see how prices really form in power and gas, how hedges and optionality protect asset value over time, and how a client brief becomes a workable structure. Rotations give me the breadth to find where I create the most value while learning the constraints and language of each desk. In analytics and risk I would apply the data hygiene habits I built at Tradeview so the desk can trust the numbers. On a trading seat I would use the hypothesis-test rhythm I learned at PwC to act with control when the tape moves. In origination I would combine listening and clear communication to build practical proposals. The programme looks like a direct path to becoming commercially literate, risk-disciplined, and client focused, which is exactly the kind of training environment I am looking for."
    },
    {
      "User": "19",
      "University": "Durham University",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526886/download/0a1543fd-2d69-414e-b5e8-755afd3d4b8d",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The commercial graduate scheme seems to be an in depth rotation of the different departments including but not limited to Power, Gas, Derivatives and Origination. The risk rotation seems of particular note, as tempering the volatile geopolitical and financial world with diligence and accountability is a position of great importance and interest to myself. It is a programme well suited to those with an interest in the energy markets and those with a deep desire for understanding both aspects of the financial and environmental world. It has greatly piqued my interest.",
      "Why do you want to work for EDF Trading?": "I am a Yachtmaster Offshore with transatlantic experience and over 10,000nm at sea - therefore an appreciation for the majesty and beauty of sustainable power is built into my very core. This exciting time for the energy markets is what motivates my application to EDFT, as the sector becomes ever more prevalent today and into the future in both the finance industry and the global stage. I am constantly striving to learn and see this opportunity as a diverse place where a great breadth can be engaged with by learning from this inter-departmental programme. Moreover, during my time at PwC BCI, I worked extensively with the firm's risk team to both control big data packages and develop strategies for managing them into the future. This experience has invigorated my desire for my work life to include complicated and complex problems that require innovative and novel solutions. I greatly enjoyed being given the responsibility to design, test and implement control processes during my time at PwC, a skill I would be appreciative to hone at EDFT.",
      "What is it about this Graduate position that stands out for you?": "The opportunity to experience the key departments that I have developed a passion for is why EDFT's graduate programme stands out to me. To be able to continue to find my motivation in the corporate world by rotating through the teams would be a privilege, one that not all firms off at the graduate level. Moreover, the market placement of EDF inspires me, as I am greatly aligned with the firm, Studying PPE I approach Macroeconomics, Geopolitics and Markets with creativity, excellence, and openness. My consciousness for client led thinking motivates me for the industry. I am unrelenting in my strive towards results for myself and the firm, so I believe I am suited to fast paced work in which I can cultivate these essential skills."
    },
    {
      "User": "20",
      "University": "Other",
      "Course": "Accountancy",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526879/download/7ca1f4bb-f824-4ca9-b976-551461e0e49b",
      "Do you have the right to work in the UK?": "No",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "Dear Hiring Manager, \n\nI have anticipated this opportunity, and I am excited about the possibility of contributing to your team while further developing my skills in corporate finance and investment banking.\n\nI hold a BSc in Accounting from the University of Ilorin and have earned a Financial Modeling and Valuation Analyst (FMVA®) certification from the Corporate Finance Institute. Through my academic studies and certification, I have been immersed in continual learning of financial reporting, financial \nanalysis, and valuation techniques, particularly in areas such as discounted cash flow (DCF) \nmodeling and comparable company analysis. Additionally, my role as an equity research intern at Andrew Stotz Investment Research equipped me with passion and great motivation for a career as an investment analyst. I am also actively working towards completing my ICAN professional exams to position myself as a highly motivated and standout candidate for the analyst role. \n\nI am eager to apply my skills and passion for finance within a company that offers innovative solutions and impactful investment strategies. \nI believe my blend of academic knowledge, curiosity, growth mindset, resilience, and passion for investment analysis makes me a valuable candidate for this program.\n\nI look forward to the possibility of learning and contributing to your team.\n\nThank you for considering my application.\n\nWarm regards, \nOpeyemi Abraham Ogunwale.",
      "Why do you want to work for EDF Trading?": "Organizations invested in CSR are a great place to work EDF Trading is one of them.",
      "What is it about this Graduate position that stands out for you?": "It aligns directly with my career goals in learning and breaking into corporate finance."
    },
    {
      "User": "21",
      "University": "Hertfordshire, University of",
      "Course": "Business",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526867/download/b5588bb3-f74c-40e7-910c-ca90449a9a75",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding is that the Commercial Graduate Programme is designed to give me broad exposure across EDF Trading’s commercial activities, from market analysis and trading support to risk management and asset optimisation. The rotational structure means I’ll spend time in different teams, learning how trading decisions are made, how risks are managed, and how EDF Trading delivers value across power, gas, and environmental products.\n\nThe role involves analysing market data, supporting traders with insights, and contributing to commercial strategies, while also developing the technical and interpersonal skills needed for a long-term career in energy trading. I also understand that the programme is structured to build future leaders who can support EDF’s wider mission of driving the energy transition and providing reliable, sustainable energy solutions.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it is a global leader in energy markets, combining strong commercial expertise with a commitment to driving the energy transition. The company’s focus on managing risk, optimizing assets, and supporting EDF Group’s low-carbon strategy resonates with my career ambitions in finance and sustainable business.\n\nWith my MBA background and experience in finance, taxation, and customer engagement, I bring strong analytical, problem-solving, and relationship management skills. My hands-on expertise with tools like SAP Business One and advanced Excel equips me to handle complex data and deliver insights that support effective decision-making in a fast-paced trading environment.\n\nI am motivated by the opportunity to contribute to a business that operates at the intersection of finance, energy, and sustainability, while also learning from EDF Trading’s innovative approach to global markets.",
      "What is it about this Graduate position that stands out for you?": "What stands out for me about this graduate position is the unique opportunity to gain exposure across different commercial areas within a global energy trading business. The rotational structure is especially attractive, as it allows me to develop a well-rounded understanding of trading, market analysis, and risk management, while also finding where I can add the most value.\n\nI’m also drawn to EDF Trading’s role in supporting the energy transition. The chance to contribute to a business that is not only commercially successful but also central to building a more sustainable energy future is very motivating for me. Finally, the balance between technical development, market exposure, and leadership potential makes this programme stand out compared to other graduate schemes."
    },
    {
      "User": "22",
      "University": "Nottingham, University of",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526865/download/26b3a213-5ff9-402e-80aa-f885686be056",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "Based on the job description, I expect a graduate to be involved in market & trading analysis, which entails tracking and analysing market trends and energy prices and using this to support EDF's trading strategy. Furthermore, taking part in reviewing customer behaviours to identify risks and opportunities is something I'd expect, alongside leading or supporting commercial projects that improve efficiency, profitability, or sustainability.",
      "Why do you want to work for EDF Trading?": "I want to join EDF because it combines my interest in commercial strategy with my passion for sustainability and impact. As Britain’s largest generator of zero-carbon electricity, EDF’s mission to help achieve Net Zero by 2050 strongly resonates with me. My experiences at Aon, AISN Group, and Halifax have built the analytical, client-facing, and interpersonal skills needed to thrive in a fast-paced commercial environment, while my leadership roles at Nottingham Consulting Network and as a youth football coach show my initiative and ability to motivate others. Furthermore, taking part in the EDF energy trading simulator really motivated me to apply as it opened up a very exciting career path for me. Getting to listen to Head of Trading, John Grey was also insightful and hearing how highly he spoke of EDF further spurred me to apply here. The rotational programme excites me as it offers the chance to develop these skills further across trading, digital strategy, and customer experience while contributing to meaningful projects that shape the future of energy.",
      "What is it about this Graduate position that stands out for you?": "The main thing that stands out is being able to rotate across different areas, allowing me a greater chance to find the team where I can impact EDF the most. Furthermore, the ability to mix technical and analytical skills that I have gathered in my degree and across internships at AON and AISN trading group, with client facing and leadership skills, really excites me and having a place where I can become a well-rounded member of the team is really important to me."
    },
    {
      "User": "23",
      "University": "Other",
      "Course": "Electronic and Electrical Engineering",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526855/download/bc10174e-c711-4246-a153-a2e841278b5d",
      "Do you have the right to work in the UK?": "No",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The role of commercial graduate allows a hands-on experience of different jobs such as market analyst or trader. On the trader job you try to identify opportunities in the electricity market, try to strategize and do the best trades possible to extract the maximum value. As a market analyst, the job is more towards the profound comprehension of the market,  the analysis we can make to understand how its evolution can impact our position and developping tools to improve our work.\n\n.\nUndertake detailed fundamental analysis of European intraday markets and further develop tools and processes used by the team.\nDevelop activity in terms of scope, scale and profitability.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it is a reference in the trading sector, there is a stimulating environment, where I can learn a lot in a small amount of time. The graduate program allows to test different jobs within EDF Trading which is a blast. As I did all my studies in France, I have a deep knowledge of EDF's evolution and targets.",
      "What is it about this Graduate position that stands out for you?": "I like that the graduate is a commercial one, as there are many intersting jobs in this field. I am particularly interested in a market analyst job or trading, so I would be delighted to do them during this graduate, and be able to choose the one I am the best at at the end of the graduate."
    },
    {
      "User": "24",
      "University": "London School of Economics and Political Science",
      "Course": "Finance",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526834/download/7a69ac7a-0463-4b18-ba4b-84bfb118bfc9",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The Commercial Graduate role at EDF is a two-year rotational programme focused on developing commercial awareness, analytical thinking, and leadership skills. It offers four six-month placements across areas like trading, market analysis, customer strategy, and digital channels.\n\nThe role involves analysing market data to support trading and commercial decisions, identifying risks and growth opportunities, and contributing to customer-focused projects that align with EDF’s Net Zero strategy.\n\nIt’s a hands-on role with real responsibility from day one, designed to give a broad understanding of the energy sector while building the skills needed for a long-term commercial career at EDF.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it’s at the forefront of energy trading, driving innovation and sustainability in a rapidly changing market. EDF's leadership in zero-carbon electricity and its commitment to the UK’s Net Zero goals align perfectly with my personal values and career aspirations in the energy sector.\n\nAfter completing the EDF Trading simulation with AmplifyMe, I gained a real appreciation for the dynamic nature of energy markets and the strategic decisions involved in trading. EDF Trading’s strong focus on analytical thinking, risk management, and real-world impact excites me. I’m particularly drawn to the opportunity to work with a team that is shaping the future of energy, with the added benefit of learning from industry experts in a collaborative environment.\n\nWith my background in economics and finance, along with hands-on experience in trading simulations, I’m eager to contribute to EDF Trading’s mission while developing the commercial and leadership skills necessary for a long-term career in the sector.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this Graduate position is the combination of structured development and real-world impact. The opportunity to rotate across key commercial areas—like trading, market analysis, and customer strategy—means I’ll gain a broad, hands-on understanding of the energy business while building skills that are directly relevant to my career goals.\n\nI’m particularly excited about the chance to work in trading and market analysis. During my asset pricing course, I was particularly drawn to the complexity of pricing commodities, and I earned a strong mark, which further sparked my interest in this area. I’m eager to apply what I’ve learned and expand my knowledge in real-world scenarios.\n\nAdditionally, I thrive in fast-paced environments where I can quickly adapt and make decisions. This role offers the perfect balance of dynamic challenges and opportunities to grow, especially within EDF’s collaborative and supportive culture. Hearing from current employees about their positive experiences has only increased my eagerness to be part of such an inclusive and forward-thinking team."
    },
    {
      "User": "25",
      "University": "Other",
      "Course": "Mathematics/Statistics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526822/download/c8195077-62e9-415d-94e8-5468b839a9a0",
      "Do you have the right to work in the UK?": "No",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "From the title of the role, since no job description was provided, I have understood that the role is about analyzing European power and gas markets, creating and trading power and gas markets in different time horizons, from PPA in the long to medium terms and trading standardized products in the short term markets.",
      "Why do you want to work for EDF Trading?": "As someone who studied and is living in France, and currently working in the Power markets, I am aware that EDF Trading is one of the key players in the field with the most assets in France and UK, with a very consciousness about the green transition and therefore acts toward net zero emissions.\nI am also impressed about the culture of EDF Trading where juniors have very high ownership and responsibility on the books they are managing.",
      "What is it about this Graduate position that stands out for you?": "As a quant in the European short term power markets, I am getting interested about the business side, that is trading, origination and structuring of power contracts. That is why I consider myself very eligible for the role."
    },
    {
      "User": "26",
      "University": "Nottingham, University of",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526807/download/4a406e0f-7c41-4a72-89ae-4864d49ef17e",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "From what I understand, this programme gives graduates the chance to rotate across different areas of EDF Trading such as trading desks, risk management, and analytics. The idea is to build a well-rounded view of how energy markets work and how trading decisions are made. It’s about analysing data, spotting risks and opportunities, and supporting traders with the information they need. I also see it as a role where you’re constantly learning — the markets move quickly, so it’s important to be adaptable and comfortable working with numbers and details in a fast-paced environment.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it sits at the centre of energy markets at a time when the industry is changing fast. The chance to be part of a business that trades power, gas and environmental products, while also playing a role in the transition to low-carbon energy, is exciting. EDF’s reputation and scale mean I’d get exposure to global markets and complex challenges early in my career. What also attracts me is the mix of teamwork and analysis — I’ve enjoyed applying those skills in my internships at EY and Moody’s, and I want to bring that same approach to a commercial setting where the impact of decisions is immediate and tangible.",
      "What is it about this Graduate position that stands out for you?": "What stands out is the variety and exposure the programme offers. Rotating across trading, risk and analytics is a rare opportunity to explore different parts of the business before specialising. For me, that’s ideal because I enjoy combining analysis with bigger-picture thinking, and I know I’ll learn the most by seeing how everything fits together. I also like that the programme doesn’t just focus on technical skills but develops commercial awareness and decision-making. Coming from an economics background and having worked on credit risk and financial analysis, I feel this is the right next step — somewhere I can use my strengths but also challenge myself in a fast-moving market."
    },
    {
      "User": "27",
      "University": "Warwick, University of",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/526795/download/057f02e6-28cb-411d-8ad1-d293940f712f",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "Based on the job description, I understand that the Commercial Graduate Scheme at EDF Trading is designed to give graduates broad exposure to the commercial side of the business, with rotations across trading, analytics, and risk-related functions. The role involves supporting trading desks with market analysis, monitoring risk, and helping to identify profitable opportunities in energy markets, while also developing a strong understanding of EDFT’s products across power, gas, LNG, and environmental commodities.\n\nIt is both analytical and commercial, requiring the ability to interpret data, model scenarios, and communicate insights clearly to traders and other stakeholders. The scheme is also a structured development pathway, aiming to build future commercial specialists who can contribute to EDF’s role in navigating the energy transition and ensuring efficient, reliable trading operations.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it combines the pace and challenge of global energy trading with the purpose of supporting EDF’s wider mission in the energy transition. EDFT’s position as a leading player in European power and gas, with a growing global LNG and environmental products portfolio, makes it one of the most dynamic and influential firms in the sector. I am particularly motivated by the opportunity to contribute to balancing renewable generation and trading environmental products, as these are central to creating a sustainable energy system.\n\nOn a personal level, I want to develop my career in a commercial role that is both analytical and strategic, where market knowledge and data-driven insights directly inform high-value decisions. My economics background has given me strong quantitative and analytical skills, and I am excited by the opportunity to apply these in an environment that is fast-moving, international, and impactful. EDF Trading’s Commercial Graduate Scheme offers the ideal platform to do so, while learning from some of the most experienced traders and market specialists in the industry.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this graduate position is the combination of breadth and depth it offers. The structured rotations across trading and commercial teams provide the chance to develop a holistic understanding of how energy markets operate, while still giving real responsibility from the start in supporting traders with analysis and market insight. I find this balance particularly attractive because it allows me to both build technical expertise and develop the commercial judgement needed for a long-term career in trading.\n\nI’m also drawn to the international dimension of EDF Trading’s business. Being part of a global team trading across power, gas, LNG, and environmental products offers exposure to diverse markets and cultures, which is something I find motivating. Finally, the fact that this scheme is linked to EDF’s wider role in the energy transition makes the work feel especially meaningful — it’s a chance to grow as a commercial professional while contributing to the future of sustainable energy."
    },
    {
      "User": "28",
      "University": "Other",
      "Course": "Mathematics/Statistics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/524992/download/1cb47a7f-95d2-4aff-afa5-532270f21db6",
      "Do you have the right to work in the UK?": "No",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "From what I understand, this graduate role is a two-year rotational programme across different desks, mainly power and gas trading which are at the heart of EDF Trading’s activity  but also in analytics, risk and modelling.\nWhat makes it so interesting is that it combines the commercial side of trading with quantitative aspects such as programming, product pricing and hedging. It’s not just observation: graduates are really involved in building models, analysing risk and contributing to the desk’s decisions.\nI also value the unique mix between the financial dimension derivatives, pricing, risk and the physical one logistics, capacity optimisation, power and gas flows which you don’t find in a pure banking environment. On top of that, the structured mentorship and exposure to shocks and news impacting markets will give me a 360° understanding of the business. That combination is exactly what makes this programme so appealing to me.",
      "Why do you want to work for EDF Trading?": "I was fortunate to do a first internship at EDF, in the pricing team, and that gave me a first exposure to EDF Trading. We had someone from EDF Trading presenting the market news and the gas prices. I joined just after the cut-off of Russian gas during the war in Ukraine, so I could really see the impact of geopolitical shocks on energy markets.\nI also worked on quantitative projects with mathematical models, and the team gave me a lot of guidance. Later, I attended a two-hour presentation about analytics and trading, which helped me understand concepts like gas power spreads.\nThese experiences convinced me that EDF Trading is at the intersection of quantitative modelling, market expertise and physical flows, which is exactly the environment I want to grow in. The culture of innovation and diversity here also resonates a lot with me.",
      "What is it about this Graduate position that stands out for you?": "For me, the standout feature is the rotation. Having the opportunity to work on power, gas, analytics, risk and origination within just two years is a real privilege. It’s the best way to understand the full picture before specialising.\nI’m particularly curious and eager to explore different perspectives from building models and programming, to understanding products and hedging strategies, to developing the commercial side of the business. This breadth is rare, and it will allow me to discover new areas I might not have considered before.\nI also like that it’s not only about financial products but also about the physical dimension flows, supply chain, logistics which makes the role much more concrete than in banking. That combination of physical and financial markets is unique, and that’s why this programme really stands out to me."
    },
    {
      "User": "29",
      "University": "Warwick, University of",
      "Course": "Mathematics/Statistics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3044/records/524613/download/db5b8f38-4d67-4b04-a336-31d51ba07d96",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "In the Commercial Graduate role at EDF, I expect to try out a variety of roles in energy trading, analytics and risk management in order to see where I am the best match. In addition, I will build both soft and hard skills necessary to understand each individual role to facilitate collaboration between different parts of the company. I will work to analyse the markets and understand the best strategies to use, as well as the best ways to approach managing risk in each scenario.",
      "Why do you want to work for EDF Trading?": "EDF's emphasis on remaining agile stands out to me. As a person with a strong dedication to taking any challenge presented to me head-on and adapting to the ongoing situation, I find the prospect of working in a company that fosters a forward-looking can-do attitude exciting.\n\nAdditionally, after attending the AmplifyMe EDF Markets and Quant Simulation event and hearing the CFO, Head of Trading, hiring team, and current employees speak, I gained a different perspective on the company. I have taken every opportunity to move to a different country and experience a new culture, through both academic and professional exchanges. During this time, I interacted with diverse groups of people and gained a strong belief in the power of a wide range of different opinions in finding the most innovative solutions. As such, after hearing all the team members express such a fondness for unity within a team and working with a diverse group to solve challenging problems, I realised that a workplace like that would be somewhere I am excited to come to every day.",
      "What is it about this Graduate position that stands out for you?": "The Commercial Graduate role at EDF stands out to me for several reasons.\n\nFirstly, I have found that I am naturally drawn to commodities trading. I have just completed the Summer Analyst experience at AmplifyMe, during which I had the opportunity to try out various trading desks and other finance-related roles. During this time, commodities trading was not only the most enjoyable of all experiences but also one for which I seemed to have the most natural aptitude. Understanding energy-related news signals helped me score among the top 10 participants in the Summer Analyst training, as well as rank third in my group within the AmplifyMe EDF Markets and Quant Simulation event. \n\nMoreover, the rotational nature of this role allows me to try out everything I enjoy. As a MSc Mathematical Finance student, I am drawn to more quantitative aspects of energy market roles. Additionally, I wrote my undergraduate dissertation on pricing and hedging using neural networks through a risk management perspective, which I am excited to explore further. Lastly, I enjoy collaboration as well as roles that involve people, so I am eager to learn more about the client-facing roles within EDF."
    },
    {
      "User": "30",
      "University": "Southampton, University of",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/527760/download/ccc33e1f-df34-452f-a400-1b774bbbd05b",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "Based on the job description, I understand that this role will provide me with a wide range of skills in multiple different areas including energy commodities trading, market risk and analytics. This will provide me with exposure to the energy trading industry through real business projects, professional training and regular interaction with senior leaders. I also understand that I will be provided with continuous coaching and mentorship allowing me to strengthen skills such as critical thinking, communication and analytics.",
      "Why do you want to work for EDF Trading?": "I have a strong interest in working at the crossroads of two areas, markets and energy. My background in economics has given me a strong foundation in understanding how market dynamics, pricing, and risk management shape global industries. What excites me about EDF Trading is the opportunity to apply that knowledge in a sector as vital and fast evolving as energy. The increasing complexity of global energy markets makes this a particularly dynamic time to contribute. EDF Trading’s reputation for innovation, strong analytical approach, and integral role within the EDF Group makes it the ideal environment for me to develop as a professional while supporting the efficient and sustainable functioning of energy markets.",
      "What is it about this Graduate position that stands out for you?": "I’m excited to join EDF’s Graduate Programme because it offers the perfect environment to develop both professionally and personally while contributing to meaningful, data-driven decisions that impact the environment and communities. EDF’s focus on sustainability and innovation resonates with my own values, and I’m particularly drawn to the opportunity to support strategic projects that improve resource efficiency and environmental outcomes. I greatly admire this mission of yours.\n\nThe chance to work alongside experts across multiple areas such as analytics, energy commodities trading and market risk where decisions are increasingly guided by data, is both motivating and inspiring. I’m especially interested in solving complex logistical challenges and helping optimise resource deployment as this aligns with my passion for data storytelling and problem-solving.\n\nI’m also enthusiastic about joining a company that values continuous development. The support network, training, and exposure offered through the programme will allow me to deepen my technical skills while building a solid foundation for a long-term career in environmental analytics.\n\nUltimately, I want to be part of a forward-thinking organisation that is using data to drive sustainability and EDF is leading that effort."
    },
    {
      "User": "31",
      "University": "Glasgow Caledonian University",
      "Course": "Other",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/526715/download/292c8e17-be77-40a3-a28a-e076635143d5",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "Yes",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "This graduate role offers structured rotations across EDF Trading’s commercial functions, including trading operations, risk management, and market analysis. It is designed to build a strong foundation in how energy markets operate, while developing analytical, problem-solving, and decision-making skills. From my background in sustainability consulting, HSE, and project coordination, I understand the importance of balancing risk with opportunity, working across functions, and engaging stakeholders effectively. I see this role as a chance to apply these transferable skills in a dynamic commercial environment, while gaining the technical expertise needed to contribute to EDF Trading’s success and its role in the energy transition.",
      "Why do you want to work for EDF Trading?": "I want to join EDF Trading because of its reputation as a global leader in energy markets and its commitment to supporting the EDF Group’s energy transition. This aligns closely with my MSc in Environmental Management and professional experience in sustainability reporting, compliance, and risk management. In previous roles, I advised clients on ESG strategies, conducted risk assessments, and coordinated projects requiring cross-functional collaboration. I am motivated to apply these skills within EDF Trading, contributing to commercial performance while supporting its low-carbon ambitions. The international scope and fast-paced environment make this an ideal place to grow my career at the intersection of finance, trading, and sustainability.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me is the structured rotation across multiple commercial functions, from trading desks to risk management teams. This offers the opportunity to build technical knowledge while identifying where I can deliver the most impact. In my career, I have worked in diverse roles spanning sustainability, HSE, and administration, where adaptability, stakeholder engagement, and analytical thinking were essential. These experiences have prepared me to thrive in fast-moving, high-stakes environments like energy trading. I am particularly drawn to the international exposure and the chance to work with experts, as this graduate role combines rigorous commercial training with contributing to EDF Trading’s role in a sustainable energy future."
    },
    {
      "User": "32",
      "University": "Sussex, University of",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/525953/download/47d54031-986a-4758-a972-75f19e9490d7",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding is that during the role, I will get to experience different parts of the energy trading team and learn something new from each role. It is not just theoretical, we will be doing hands-on work on real projects as well as being given the opportunity to ehance our skillset.",
      "Why do you want to work for EDF Trading?": "The energy sector is always changing and shifting to renewable energy and sustainability goals. EDF is offering me the opportunity to learn and apply the relevant skills to an industry that is rapidly growing and important for the future economy. As an economics and finance graduate, I have a foundational theoretical understanding of the finance industry, but EDF is not only going to help me build on that but also gain the relevant practical experience.",
      "What is it about this Graduate position that stands out for you?": "The main thing that stands out to me is that during the 2-year programme, you get rotated around the firm every 6 months. I am very fond of this as I believe this is the most practical and efficient way of gaining professional experience as well as seeing what you might be stronger at. A lot of programmes stick you in the same position for 2-3 years, which does not allow me to explor. EDF's programme will allow me to explore and enhance my skills."
    },
    {
      "User": "33",
      "University": "Exeter, University of",
      "Course": "Mathematics/Statistics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/525617/download/ae52d58d-6ced-40b5-a1f7-1e3504ab61c3",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding of the role is 4 rotation periods around the core business functions in trading. It will have both hands on work on live business projects as well as technical and professional development.",
      "Why do you want to work for EDF Trading?": "I would like to work there as the position is not just observational, I like the idea of a fast paced trading floor with periods of reflection and risk analysis. As a mathematics with economics student, who doesn't know which part of trading I want to work in, I feel like having the chance to dive into each one is perfect for me.",
      "What is it about this Graduate position that stands out for you?": "I love the idea of trying out the roles while learning at a fast pace so I am effective to all of them. additionally I like the idea of working for EDF as they have branches throughout Europe and are also a global low carbon energy leader"
    },
    {
      "User": "34",
      "University": "Aston University",
      "Course": "Business",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/525462/download/41f2d152-5e93-4610-81be-f3215b4b9727",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The commercial graduate program as EDF Trading is a 2 year scheme providing us with a comprehensive understanding into the world of energy trading industry .\nGiving is the opportunity to complete 4 six month rotations allowing exposure to both commercial and analytical functions of the trading floor . The programme combines hands-on project work with formal training in industry-specific, technical, and professional skills. the role is about building a solid grounding in the operations of energy markets, developing both commercial and technical competencies, and positioning graduates for future leadership or specialist roles within EDF Trading.",
      "Why do you want to work for EDF Trading?": "I want to work at EDF because being  part of a business that is both commercially dynamic and directly contributing to the energy transition really excites me. The rotation will give me the exposure a cross different areas such as risk, trading and analytics. Which I believe will help me build a strong foundation in my career.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me is the hands on business projects , instead of just shadowing teams , having the opportunity to take on real projects will prompt my critical thinking and my quantitative skills in a fast paced trading environment something that really interests me."
    },
    {
      "User": "35",
      "University": "Newcastle University",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/525225/download/4a0522ca-1bd8-4276-8fa3-4724cc556683",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "This role would see me gain a deep understanding or the energy commodities market and how EDFT operates, both by training and by hands-on work on real projects. The by the end of the 2-year programme, I will be confident in analysing and managing risk, as well as building relationships, both with internal and external customers. This will put me in a great position to go into a role at EDFT that I feel I will excel the most, based on my experiences across EDFT departments.\nThroughout the programme, I will have regular check-ins with a manager and mentor, to make sure that I am dealing with all of the new information and experiences, and that I am able to apply everything that I am learning to my work.",
      "Why do you want to work for EDF Trading?": "EDFT has a great reputation for having industry-leading experts, who I would love to learn from and collaborate with to build on what has already been achieved at the company. At EDFT, I would be surrounded by like-minded people who drive each other to succeed, so that high performance is a daily requirement. This is an ethos that I find extremely rewarding and one that allows me to thrive.\nI am also very interested in energy markets, and would love to be able to develop my knowledge and to have an intimate understanding of each component of the market at a time of such great change, which I find exciting.",
      "What is it about this Graduate position that stands out for you?": "The 2-year length of this programme is appealing to me, as it gives a good amount of time for me to learn different aspects of the work done at EDFT. This will allow me to have both a broad and deep foundation for a future career, and it will also allow me to find where my skills are best suited.\nThe mentorship offered by this role is also appealing, as it signals EDFT's commitment to training and investing into their staff. This gives me confidence not only in my own progression, but also that my colleagues will be highly-skilled and professional."
    },
    {
      "User": "36",
      "University": "West London, University of",
      "Course": "Computer Science and IT",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/524810/download/403617e6-cd03-4527-b4b9-6c117da25b5e",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "Based on the job description, I understand that the Commercial Graduate Programme is designed to give graduates hands-on experience in areas such as sales, client management, and digital marketing, while building commercial awareness and professional skills. The role involves learning how to support clients, analyse data, contribute to campaigns, and develop strategies that drive business growth, all within a structured programme that provides training and career development opportunities.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it is a global leader in energy trading with a strong reputation for innovation, sustainability, and delivering real value in the energy markets. The opportunity to join a company that operates at the intersection of energy, finance, and technology is exciting, as it would allow me to apply my analytical and problem-solving skills in a fast-paced, dynamic environment. I am particularly motivated by EDF’s focus on the transition to cleaner energy and would be proud to contribute to a business that plays such an important role in shaping the future of global energy.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this Graduate position is the opportunity to gain structured training and hands-on experience while contributing to real projects that make an impact. I’m particularly drawn to the balance of professional development, exposure to different areas of the business, and the chance to build skills that will support a long-term career in a fast-paced and dynamic industry."
    },
    {
      "User": "37",
      "University": "Aston University",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/524492/download/17a013b3-1da9-4ec9-b0af-7d82a4f6a677",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding of this role is that it is a two-year graduate programme designed to give exposure to the different areas of EDF Trading through four six-month rotations. These rotations cover areas such as trading, risk, analytics, and origination, giving graduates both a technical and commercial perspective of how the business operates in the energy markets.\n\nThe programme combines hands-on project work with structured training, mentoring, and regular interaction with senior teams, which helps to build both industry knowledge and professional skills. It is designed to provide a solid foundation in the energy commodities sector, while allowing graduates to explore different career paths before moving into a permanent role, such as trading, analytics, or market risk.",
      "Why do you want to work for EDF Trading?": "EDF Trading offers a unique opportunity to gain hands-on experience across multiple areas of the energy trading business. The structured rotations will allow me to build a solid understanding of the power and gas markets, while developing both my existing analytical and commercial skills needed to succeed in such a fast-paced environment.\n\nI am particularly drawn to the balance between technical work—such as market risk and analytics—and the client-facing aspects of origination, as this will give me a well-rounded view of the industry. EDFT’s reputation as a leader in low-carbon energy, combined with its inclusive and collaborative culture, makes it an ideal environment to grow my career.\n\nWith my strong analytical ability, interest in global energy markets, and willingness to learn, I am eager to contribute to EDFT’s success while developing into a future commercial professional within the business.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this graduate position is the breadth of exposure it provides across the core areas of a trading business, from analytics and risk to origination and trading itself. The rotational structure offers a rare chance to build a well-rounded, holistic understanding of energy markets while developing both technical and commercial skills. I also value the emphasis on mentorship and training, as it shows EDF Trading’s commitment to developing future talent. Finally, the opportunity to contribute within a global leader in low-carbon energy makes the programme particularly exciting, as it combines professional growth with meaningful impact in the transition to cleaner energy."
    },
    {
      "User": "38",
      "University": "Greenwich, University of",
      "Course": "Law",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/522344/download/ba105c73-982e-41cf-bd62-cca0ac451985",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The Commercial Graduate Programme at EDF Trading is designed to give exposure across the core areas of the business that support its position as a leading player in the European wholesale energy markets. The role involves:\n\nMarket Exposure: Gaining first-hand experience in European power and gas markets, understanding how trading activities help manage price risks, optimise assets, and provide liquidity to the market.\n\nCommercial Support: Assisting traders, analysts, and commercial teams in market research, financial modelling, and risk analysis to support trading decisions and identify new opportunities.\n\nAsset Value Creation: Learning how EDFT applies its trading capabilities to optimise the EDF Group’s generation portfolio, ensuring value is captured from both physical and financial markets.\n\nCross-functional Collaboration: Rotating across different commercial functions (e.g., trading desks, risk, origination, analytics) to build a broad understanding of how trading, operations, and strategy interact to deliver value.\n\nEnergy Transition Focus: Supporting EDFT’s role in the wider EDF Group’s mission of leading the energy transition to low-carbon solutions, by developing knowledge of renewable integration, carbon markets, and evolving energy regulations.\n\nOverall, I understand the role as a development pathway into a commercial career within energy trading, where I would combine analytical skills, market awareness, and problem-solving to help EDFT deliver value to both the EDF Group and third-party customers.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it combines two areas I am passionate about: energy markets and the transition to a low-carbon future. As a specialist in wholesale energy trading and part of the EDF Group, EDFT provides a unique opportunity to contribute to one of the most important challenges of our time — ensuring reliable, affordable, and sustainable energy.\n\nWhat particularly attracts me is EDFT’s strong market presence in European power and gas, its ability to optimise complex assets, and its role as a gateway between buyers and sellers of energy commodities. I am motivated by the opportunity to work in such a dynamic, fast-paced environment where analytical rigour and commercial awareness directly impact trading strategies and business outcomes.\n\nFinally, EDF Trading’s international reach and structured Commercial Graduate Programme offer an outstanding platform to build a career. The chance to rotate across different business areas, learn from experienced traders and analysts, and contribute to a company at the forefront of energy markets is exactly the kind of challenge I am looking for.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this Graduate position is the opportunity to gain broad exposure across EDF Trading’s commercial functions while developing a deep understanding of energy markets. The structured rotations mean I will not only build strong analytical and commercial skills, but also appreciate how different teams — from trading and analytics to risk and origination — come together to deliver value.\n\nI am particularly drawn to the balance between learning and responsibility. Being able to contribute to real projects, while receiving guidance and training from experienced professionals, makes this programme both challenging and supportive. This combination is rare and provides an excellent platform to accelerate my career in energy trading.\n\nFinally, the chance to be part of a company that plays a central role in European power and gas markets, while also contributing to the wider EDF Group’s low-carbon mission, makes this position uniquely impactful. It offers the blend of commercial challenge, international outlook, and purpose that I am looking for in a graduate career."
    },
    {
      "User": "39",
      "University": "Aston University",
      "Course": "Business",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/521123/download/2f13ccd6-73f9-4181-be08-2b91633b14b3",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding of this role is it gives you the chance to really explore the energy trading world through four six-month rotations across areas like trading, risk, analytics and origination. It’s designed to give graduates hands-on experience with real business projects while learning how EDF Trading operates in the European power and gas markets.\n\nI see it as an opportunity to develop both technical and professional skills, work closely with experienced teams, and understand the industry from multiple perspectives. The programme also values curiosity, collaboration and mentorship, which makes it a place where you can grow, ask questions, and contribute to meaningful work. Overall, it’s about gaining a strong foundation in energy trading, building connections, and discovering where your strengths and interests fit within EDF Trading’s fast-paced, innovative environment.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it combines my interest in the energy industry with the chance to learn and grow in a fast-paced, innovative environment. I admire how EDFT is at the forefront of European power and gas markets, using both physical and financial expertise to create value for clients and the wider EDF Group.\n\nI am particularly drawn to the company’s culture of collaboration, respect, and curiosity, where employees are encouraged to speak up and learn from one another. The Commercial Graduate Programme excites me because it offers hands-on experience across different areas of trading, risk, analytics and origination, giving me the opportunity to build a strong foundation while contributing to meaningful projects. I am eager to be part of a team that values innovation, learning, and making a tangible impact in the energy market.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this Graduate position is the structured, hands-on approach that allows you to gain experience across multiple areas of energy trading. The opportunity to rotate through trading, risk, analytics, and origination is particularly appealing because it aligns with my experiences in marketing and project management, where I developed strong analytical and problem-solving skills and learned to work in fast-paced, data-driven environments.\n\nI am also drawn to the emphasis on mentorship, collaboration, and continuous learning. In my previous roles, I have thrived when supported by a team while being encouraged to take initiative, and I see that same culture reflected in this programme. The chance to combine my passion for energy markets with real responsibility from day one makes this Graduate position stand out as an ideal place to launch my career."
    },
    {
      "User": "40",
      "University": "Kingston University",
      "Course": "Business",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/520982/download/6b9208bf-f58b-4402-9203-f79e1e296042",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "I see this programme as a chance to learn how energy trading works by rotating across different teams like trading, market risk and analytics. It’s a way to see directly on the trading floor, build up technical and commercial skills, and understand how EDF Trading operates in the wider energy markets. For me, it’s about gaining real experience while exploring different career paths in the industry.",
      "Why do you want to work for EDF Trading?": "EDF Trading stands out to me as a leader in European power and gas, but also part of the EDF Group, which is at the heart of low-carbon energy. I really value the idea of working somewhere that combines market expertise with a bigger mission around the energy transition. I also like the culture described - diverse, innovative and collaborative , which sounds like the kind of environment I’d enjoy and grow in.",
      "What is it about this Graduate position that stands out for you?": "The main thing that appeals to me is the rotation system. I like that I’d get to experience different areas, figure out what I enjoy most, and learn from specialists along the way. The mix of hands-on projects, training and mentoring makes it feel like a great place to start my career and build a strong foundation in energy trading."
    },
    {
      "User": "41",
      "University": "Nottingham, University of",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/520839/download/6d4a6275-1364-4ccc-badd-6392e6f49cbf",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The EDFT graduate role is a rotational-based role comprising of 4 rotations, each lasting 6 months. I imagine I will circulate the various teams within the energy trading department, each with an alternative perspective and unique interactions.",
      "Why do you want to work for EDF Trading?": "I believe I am well-suited to this scheme. Energy trading plays a vital role in this vast industry and is essential to everyday life. I enjoy project-based work and thrive when collaborating with others or engaging with different teams to solve problems. I am eager to join a larger company where I can establish myself, grow professionally, and build a strong foundation for my career.",
      "What is it about this Graduate position that stands out for you?": "One of the biggest attractions of this position for me is that it’s rotational. Since I’m still early in my professional career, I want to explore different paths while I have the chance. During my placement year, I found that the rotation I enjoyed most was actually the one I had been least sure about beforehand. I’m not afraid to pursue any career direction, and I’ll always keep an open mind toward new opportunities."
    },
    {
      "User": "42",
      "University": "Cardiff University",
      "Course": "Environmental Science",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/520695/download/e1561811-1da6-44eb-8aa9-da0cfeac3856",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The commercial graduate programme is a two-year scheme with four six-month rotations across multiple different areas. It is designed to provide hands-on exposure to energy markets, combining data analysis, risk assessment and commercial decision making. The role also focuses on professional development through training, mentoring and real business projects, preparing myself for a long-term career in the industry.",
      "Why do you want to work for EDF Trading?": "EDF Trading stands out as a leader in the energy markets with clear focus on low-carbon solutions. I am motivated by the chance to work in a fast-paced environment that combines data-analysis, risk management and commercial decision making. The rotational structure of the graduate scheme is particularly appealing as it will allow me to gain broad exposure across trading, analytics and risk while building the skills needed for a long-term career in the energy sector.",
      "What is it about this Graduate position that stands out for you?": "The rotational structure really stands out to me because it offers the chance to experience different areas of the trading floor, from market risk to analytics and origination. This variety will allow me time to build a well-rounded understanding of the energy markets while developing both technical and commercial skills. I'm also drawn to the opportunity to work on a real business projects in a fast-paced environment while receiving mentorship and training that will accelerate my professional growth."
    },
    {
      "User": "43",
      "University": "Oxford, University of",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/520057/download/4f5ce2c3-3a07-4506-abd4-c875feeef5e0",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "Over two years I would rotate among trading desks, risk, analytics and origination, to understand the backbone of EDF Trading’s commercial activity. I will learn how traders find and execute on opportunities, how risk teams analyse exposures, and how origination builds relationships that secure long-term value.\n\nI would also have the chance to contribute directly to the success of the desks I am assigned to. I would perform quantitative and qualitative analysis and take an active role in delivering commercially impactful projects. These rotations, combined with structured training and support, will ensure I build the practical skills and commercial perspective required for a career in energy trading.",
      "Why do you want to work for EDF Trading?": "I am fascinated by the intellectual challenge of energy trading. It means reading geopolitical shifts, macroeconomic forces and the physical realities of supply chains. An equity investing internship confirmed how much I enjoy financial analysis in dynamic markets; trading energy would further test my skillset in a faster setting tied to physical operations, requiring analytical rigour, sharp commercial instinct and technical depth.\n\nI want to join EDF Trading for its role as the trading arm of Europe’s largest generator. Breadth across power, gas, LNG and environmental products offers exposure to the entire energy system. I am keen to work on integrating intermittent renewables into power markets and trading around nuclear output to enable decarbonisation while keeping the system stable. Finally, EDF Trading’s culture closely matches how I work. I value open discourse and flexibility when the pressure is on, and an innovative environment is the ideal catalyst for my development.",
      "What is it about this Graduate position that stands out for you?": "This role stands out for its focus on breadth and development. Rotating across trading, risk, analytics and origination would give me a system-wide view of EDF’s commercial activity, while helping me understand where I can contribute most value before specialising. Working on live flows alongside traders and risk managers would accelerate my commercial judgement in a way that classroom theory cannot. The combination of structured support, early responsibility and exposure to different products is exactly what I am looking for.\n\nI am also drawn to the chance to learn from colleagues who combine market judgement with technical expertise in power, gas and environmental products, and who use both quantitative analysis and long-term relationships to create value. The programme would give me the chance to work closely with such people across desks and seniority levels, preparing me for a career in energy markets."
    },
    {
      "User": "44",
      "University": "Nottingham Trent University",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/519507/download/85815ccb-c049-4205-86fd-b5ee019132fa",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "From my understanding, this programme is a two-year rotational scheme across trading, risk, analytics and origination. I will contribute to daily market activities while learning how energy is priced, traded and managed. It will give me a foundation in commercial decision-making, risk control and client engagement, preparing me to grow into a long-term role in energy trading.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because you combine the pace of a trading floor with a mission to support the energy transition. Your work in carbon and renewable energy markets shows that trading can create both commercial and environmental value, which aligns strongly with my own interests. With my economics background, experience turning data into decision-ready insights, and passion for sustainable investing, I am motivated to contribute to a team where every trade can support both client outcomes and progress toward net zero.",
      "What is it about this Graduate position that stands out for you?": "I want to work for EDF Trading because you combine the pace of a trading floor with a mission to support the energy transition. Your work in carbon and renewable energy markets shows that trading can create both commercial and environmental value, which aligns strongly with my own interests. With my economics background, experience turning data into decision-ready insights, and passion for sustainable investing, I am motivated to contribute to a team where every trade can support both client outcomes and progress toward net zero."
    },
    {
      "User": "45",
      "University": "Royal Holloway, University of London",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/519095/download/9ef76202-b5ce-4979-9335-029eccc2fc51",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The EDF Trading Commercial Graduate Programme offers a dynamic two-year rotational scheme that provides hands-on experience in trading, market risk, analytics, quant risk, and origination. This programme consists of four six-month placements, through which graduates gain a robust understanding of energy markets by engaging in real projects, receiving training, and building networks with senior leaders. Designed for curious, commercially minded individuals, the programme caters to those with strong analytical skills and a keen interest in energy. It prepares graduates for careers as traders, analysts, or risk specialists in a fast-paced global environment.",
      "Why do you want to work for EDF Trading?": "I am eager to join EDF Trading because it uniquely blends my passion for the energy sector with my enthusiasm for fast-paced, analytical environments. The rotational structure of the Commercial Graduate Programme is particularly appealing to me, as it offers the opportunity to experience variety and continuous learning before I choose to specialize.\nEDF Trading's culture of respect and collaboration also attracts me. In my previous roles, I have seen how open communication and teamwork can drive significant results, and I thrive in such environments. I would be proud to contribute to EDFT’s mission of shaping the future of low-carbon energy while building a meaningful career.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this Graduate position is the rotational structure, which offers the chance to gain exposure across trading, risk, analytics, and origination before choosing a clear career path. Because I value variety and continuous learning, the opportunity to rotate through different areas of the business is particularly appealing. I’m also drawn to the fact that graduates work on real projects from day one, benefiting from mentoring and support, yet also shoulder genuine responsibility. That balance of guidance and independence is exactly what I’m looking for to grow my skills. Finally, the position’s focus on the energy sector is a big motivator for me, as I’m eager to be part of an industry that is both fast-moving and essential to the transition to a low-carbon future."
    },
    {
      "User": "46",
      "University": "Royal Holloway, University of London",
      "Course": "Geography",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/518747/download/729f8690-c626-4b8a-9bdd-33b4c939240e",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "The role develops future leaders in the energy sector through rotation placements across the sub-sectors of energy commodities trading, market risk, analytics, quant risk, and origination. Through this experience across a variety of sectors in the company, new skills can be developed and actively put to work within a challenging and progressive trading environment. Through this exposure to different sectors, graduates can find their sector of expertise and particular interest where they can thrive within EDF trading.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading so I can make a meaningful impact within the energy trading industry through my interests in helping to reach Net Zero goals. I understand that EDF trading plays a key role in the transition to low-carbon energy markets, and I believe my academic background focusing on sustainable urban environments is beneficial for this matter.",
      "What is it about this Graduate position that stands out for you?": "The opportunity to explore multiple sectors of EDF Trading and gain valuable hands-on experience in each is what appeals to me most. Through such a programme, I would be able to develop a vast understanding of the energy trading industry, and I could specialise in a particular sector where my skills and expertise are proven to be most effective."
    },
    {
      "User": "47",
      "University": "Manchester, University of",
      "Course": "Mathematics/Statistics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/518698/download/17c2fc8b-e43e-4874-8ba7-77af2725757d",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "I understand this to be a structured two-year graduate programme based in London made up of four six-month rotations across trading, market risk, analytics, quant risk and origination, focused on hands-on projects, training and mentorship. It requires strong quantitative, programming and commercial skills — my Financial Mathematics background and projects (a Python MPT optimiser and ARIMA forecasting models) give me the technical foundation to contribute quickly and learn across rotations.",
      "Why do you want to work for EDF Trading?": "I want to join EDF Trading because it’s a market-leading, technically driven business where I can apply my quantitative skills to real trading problems while learning across rotations. The programme’s mix of analytics, market risk and trading aligns perfectly with my experience building portfolio optimisation and ARIMA forecasting models in Python.",
      "What is it about this Graduate position that stands out for you?": "The rotational, hands-on nature of the programme; combining trading exposure, technical projects and mentorship is exactly the environment where I can apply my modelling and programming experience and develop into a commercial analyst."
    },
    {
      "User": "48",
      "University": "Kent, University of",
      "Course": "Economics",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/518369/download/201606e5-0fe9-4f70-b7bd-ef198252e10d",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "My understanding of this role is that it offers a structured pathway into the energy trading industry, giving me the opportunity to gain broad exposure across the trading floor. The programme is designed around four six-month rotations, each focusing on a different area such as commodities trading, market risk, analytics, quantitative risk and origination. This would allow me to build both a strong technical foundation and a commercial awareness of how the business operates within fast-moving energy markets.\n\nAlongside the day-to-day work, the programme places emphasis on developing key skills through training, mentoring and networking, as well as working directly with senior teams on live projects. The rotational structure also means I’d be able to test different paths, from hands-on market analysis to client-facing origination, before deciding where my strengths and interests align best. Overall, I see it as a role that combines analytical rigour, commercial decision-making and collaboration in a dynamic sector where adaptability is essential.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because you’re not just at the center of energy markets—you’re shaping where they go next. The values of innovation, adaptability, and excellence run clearly through your culture. You don’t just follow what’s happening, you anticipate change, build tools to make sense of complexity, and translate that into action that has real impact—for customers, for the grid, and for sustainability.\n\nWhat draws me most is EDFT’s commitment to investing in data and automation, and its mission to drive a low-carbon future through products like PPAs, environmental certificates, and renewables optimisation. The fact that you are modernising how trading works, integrating green energy with risk management, responding to market signals in real time—this aligns with how I want to work. I’ve developed strong programming, modelling and quantitative experience, and I thrive in environments where you think differently, push for excellence, and hold yourself to high standards. I believe I will be able to contribute meaningfully: spotting trading opportunities, helping build tools or models, and working with teams that value rigor and integrity as much as speed.\n\nIn short, EDF Trading offers a place where I can combine my analytical skills, my interest in energy transition and my desire to work somewhere that doesn’t settle for safe but aims for sustainable and bold outcomes.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this graduate position is the chance to gain direct exposure to origination and energy trading, two areas that are central to how the markets evolve and where real commercial value is created. Origination excites me because it’s about building long-term client relationships, structuring deals that align with both market opportunities and strategic needs. Energy trading, meanwhile, is fast-paced and analytical, where you can see the immediate impact of decisions and use data to drive outcomes in real time. The structured rotations and emphasis on learning and development make this programme unique—it offers the chance to build technical expertise, develop commercial judgement, and learn directly from experienced professionals on the trading floor. For me, this is the perfect combination of challenge, growth, and the opportunity to play a meaningful role in shaping the energy transition."
    },
    {
      "User": "49",
      "University": "Westminster, University of",
      "Course": "Business",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/517998/download/0ec26b4d-0896-4802-ab76-c1da05d05214",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "I understand that the EDF Trading Commercial Graduate Programme is a two-year rotational programme based in London, designed to give graduates broad exposure to the energy trading industry. It provides hands-on experience across areas like trading, market risk, analytics, and origination, while offering professional skills training, mentoring, and the chance to build a global network. The programme develops commercially astute, analytical, and entrepreneurial graduates who can progress into roles such as junior trader, analyst, or market risk analyst.",
      "Why do you want to work for EDF Trading?": "I want to work at EDF Trading because it offers the chance to develop commercial and analytical skills in a fast-paced, high-stakes environment. This is similar to the pressure and responsibility I experienced during my year-long NHS placement. In the NHS, I learned to analyse complex information, collaborate across teams, and adapt quickly — skills I believe are directly applicable to trading and risk analysis. EDFT’s structured rotational programme and focus on innovation in energy markets make it the ideal place to apply these skills while building a career in energy trading. EDF offers a unique opportunity to gain hands-on experience across the energy trading sector, while developing my analytical and commercial skills through its structured rotational programme. I’m excited by EDFT’s role in driving the European energy market and the energy transition, and the chance to learn from experts in a collaborative, innovative environment aligns perfectly with my career goals.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about the EDF Trading Commercial Graduate Programme is the opportunity to rotate across different areas like trading, market risk, and analytics, gaining a real understanding of the energy markets while developing my skills in a hands-on, high-pressure environment. The combination of structured rotations, mentoring, and exposure to real business projects really excites me because it offers both professional growth and the chance to make a tangible impact. I’ve always been fascinated by how markets operate and how data-driven decisions can create tangible outcomes, which makes this programme particularly exciting for me."
    },
    {
      "User": "50",
      "University": "East Anglia, University of",
      "Course": "Accountancy",
      "Please upload your CV": "https://www.rmp-connect.com/events/3039/records/517636/download/e50aaa0c-3a8f-4dde-9ac0-c60d014c8bea",
      "Do you have the right to work in the UK?": "Yes",
      "Do you require visa sponsorship?": "No",
      "Do you have at least a grade C or above/grade 4 or above in GCSE Maths?": "Yes",
      "Are you available from September 2026?": "Yes",
      "What is your understanding of this role based on the job description?": "I see the Commercial Graduate Programme as a chance to build a broad understanding of EDF’s business by working across different areas such as strategy, contracts, customer propositions, and market analysis. The rotational structure really appeals to me because it means I can gain exposure to different challenges, learn from specialists in each team, and gradually shape where I can add the most value.\nIt’s clear the role isn’t just about analysing data, but also about using those insights to influence decisions, work with stakeholders, and support EDF in delivering affordable and sustainable energy. That balance of technical analysis and collaboration is something I really enjoy — during my placement at Honda Motor Europe I worked with teams across multiple regions, testing financial controls and presenting findings to senior stakeholders. I found that combining the detail of the numbers with clear communication was where I had the biggest impact, and I think that experience translates well into what EDF is looking for.\nWhat excites me most, though, is the bigger picture. EDF isn’t just any commercial organisation — it’s at the centre of the UK’s energy transition. Being part of projects that help move the country towards net zero, while also learning the commercial side of how a business of EDF’s scale operates, feels like a rare opportunity to grow my career while contributing to something that matters on a national level.",
      "Why do you want to work for EDF Trading?": "I am keen to work for EDF Trading because it combines the fast-paced, analytical nature of global markets with the purpose of driving the energy transition. The chance to operate in a dynamic trading environment while being part of a business that plays a central role in Europe’s low-carbon future is a unique proposition that really appeals to me.\nFrom my placement year in corporate audit at Honda Motor Europe, I gained first-hand experience working with large datasets, testing financial controls, and reporting findings to senior stakeholders. I enjoyed the challenge of analysing information under time pressure and identifying insights that influenced decision-making. In addition, my extracurricular roles — such as managing budgets and securing funding as Treasurer of the UEA Golf Club — strengthened my ability to think commercially and make informed financial decisions. I believe these skills translate directly into the demands of trading, where attention to detail, commercial awareness, and clear communication are essential.\nEDF Trading stands out to me because of its reputation as a leading energy trader, its global presence, and its ability to combine deep market expertise with the wider purpose of supporting EDF Group’s net zero ambitions. I am particularly drawn to the opportunity to learn from experienced traders and to develop my skills in a high-performance environment where every decision has a tangible impact.",
      "What is it about this Graduate position that stands out for you?": "What stands out to me about this Graduate position is the combination of early responsibility, structured development, and the chance to contribute to a sector that is both commercially challenging and socially important. The rotational nature of the programme really appeals to me because it means I won’t just be confined to one area — I’ll be able to experience different parts of the business, broaden my perspective, and build a more rounded commercial skill set before deciding where I can make the biggest impact.\nWhat also makes this position stand out is the balance between analysis and collaboration. I enjoy working with data and identifying insights, but I also enjoy the people side — presenting findings, influencing decisions, and working with colleagues to solve problems. During my placement at Honda Motor Europe, for example, I carried out financial control testing but also worked closely with stakeholders across multiple regions to explain results and recommend improvements. Having that mix of technical and interpersonal challenge is something I value, and I see the same in this role.\nFinally, what excites me most is the opportunity to develop within EDF, an organisation that is central to the UK’s energy future. Being able to grow as a commercial professional while contributing to projects that help drive the transition to net zero makes this graduate programme feel both professionally rewarding and personally meaningful."
    }
  ],
  "analysis": "### Analysis of Job Applications for EDF Trading - Graduate Scheme\n\n1. **User 1 - Overall Score 13/15 - Q1: Yes Q2: Yes Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 5* - Strong understanding of the role and clear motivation for joining EDF Trading, well-aligned with the program's structure.**\n   \n2. **User 2 - Overall Score 14/15 - Q1: Yes Q2: No Q3: Yes Q4: 5* Q5: Yes Q6: 4* Q7: 5* - Expresses a comprehensive understanding of the role and industry, with a strong desire to contribute to EDF's mission.**\n\n3. **User 3 - Overall Score 14/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 5* Q7: 5* - Solid grasp of the internship's structure and clear motivations for wanting to work at EDFT.**\n\n4. **User 4 - Overall Score 11/15 - Q1: Yes Q2: No Q3: Yes Q4: 3* Q5: Yes Q6: 4* Q7: 4* - Good understanding of the structure but lacks depth in detailing how they align with EDF's mission.**\n\n5. **User 5 - Overall Score 10/15 - Q1: Yes Q2: No Q3: Yes Q4: 3* Q5: Yes Q6: 3* Q7: 4* - Somewhat generic understanding of the role and less motivation for EDFT compared to higher-scoring candidates.**\n\n6. **User 6 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Displays a strong understanding of the role and motivation but could elaborate more on personal alignment with EDFT values.**\n\n7. **User 7 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Good understanding of the internship but lacks specific detail in the desire to join EDF Trading.**\n\n8. **User 8 - Overall Score 8/15 - Q1: No Q2: Yes Q3: Yes Q4: 2* Q5: Yes Q6: 2* Q7: 2* - Limited understanding of the role and company; responses are very generic.**\n\n9. **User 9 - Overall Score 11/15 - Q1: Yes Q2: No Q3: Yes Q4: 3* Q5: Yes Q6: 4* Q7: 4* - Solid understanding of the role but could provide more personal connection to EDFT's mission.**\n\n10. **User 10 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Shows a good grasp of the role and aligns well with EDFT’s values but could detail more about the specific internship structure.**\n\n11. **User 11 - Overall Score 13/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 5* - Clear understanding of the role and well-articulated motivations for joining EDF Trading.**\n\n12. **User 12 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Shows good understanding of the internship and aligns personal interests with EDF’s mission.**\n\n13. **User 13 - Overall Score 10/15 - Q1: Yes Q2: No Q3: Yes Q4: 3* Q5: Yes Q6: 3* Q7: 3* - Some understanding of the role but lacks depth and clear motivation for EDFT.**\n\n14. **User 14 - Overall Score 0/15 - Q1: No Q2: Yes Q3: Yes Q4: 1* Q5: Yes Q6: 1* Q7: 1* - No clear understanding of the role or motivation for EDF Trading.**\n\n15. **User 15 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Strong motivation and understanding of the role and how it fits with EDFT’s mission.**\n\n16. **User 16 - Overall Score 14/15 - Q1: Yes Q2: No Q3: Yes Q4: 5* Q5: Yes Q6: 4* Q7: 5* - Excellent understanding of the role and connection to EDFT’s mission, shows strong potential.**\n\n17. **User 17 - Overall Score 5/15 - Q1: No Q2: Yes Q3: Yes Q4: 1* Q5: Yes Q6: 1* Q7: 2* - Very limited understanding of the role and motivation.**\n\n18. **User 18 - Overall Score 11/15 - Q1: Yes Q2: Yes Q3: Yes Q4: 3* Q5: Yes Q6: 4* Q7: 4* - Good understanding of the role with some motivation but lacks depth in linking personal goals to EDFT's mission.**\n\n19. **User 19 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Strong understanding and clear motivations for joining EDFT, aligns well with values.**\n\n20. **User 20 - Overall Score 10/15 - Q1: No Q2: Yes Q3: Yes Q4: 2* Q5: Yes Q6: 3* Q7: 2* - Limited understanding of the role; responses are generic and lack detail.**\n\n21. **User 21 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Good balance of understanding the role and motivation for EDF Trading.**\n\n22. **User 22 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Clear understanding of the role and how the candidate's background aligns with EDFT's mission.**\n\n23. **User 23 - Overall Score 6/15 - Q1: No Q2: Yes Q3: Yes Q4: 1* Q5: Yes Q6: 2* Q7: 2* - Very limited understanding, generic responses.**\n\n24. **User 24 - Overall Score 14/15 - Q1: Yes Q2: No Q3: Yes Q4: 5* Q5: Yes Q6: 5* Q7: 4* - Extensive understanding and motivation, aligns well with EDFT's mission.**\n\n25. **User 25 - Overall Score 10/15 - Q1: Yes Q2: Yes Q3: Yes Q4: 2* Q5: Yes Q6: 3* Q7: 2* - Limited understanding of role with some motivation but lacks clarity.**\n\n26. **User 26 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Good understanding of the role and how it aligns with personal aspirations.**\n\n27. **User 27 - Overall Score 14/15 - Q1: Yes Q2: No Q3: Yes Q4: 5* Q5: Yes Q6: 4* Q7: 5* - Strong motivations and understanding of the role, aligns well with EDFT values.**\n\n28. **User 28 - Overall Score 10/15 - Q1: No Q2: Yes Q3: Yes Q4: 2* Q5: Yes Q6: 3* Q7: 2* - Limited understanding of the role; responses are vague.**\n\n29. **User 29 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Good grasp of the internship and motivation for EDF Trading.**\n\n30. **User 30 - Overall Score 13/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 5* - Strong understanding of the role and clear motivations for joining EDF Trading.**\n\n31. **User 31 - Overall Score 11/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 3* Q7: 4* - Good understanding of the role with some motivation for EDFT.**\n\n32. **User 32 - Overall Score 10/15 - Q1: Yes Q2: No Q3: Yes Q4: 3* Q5: Yes Q6: 3* Q7: 1* - Limited understanding of the role and vague motivations.**\n\n33. **User 33 - Overall Score 11/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 3* Q7: 2* - Good grasp of the role but lacks depth in motivation.**\n\n34. **User 34 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Strong understanding of the role and how it aligns with EDFT's mission.**\n\n35. **User 35 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Good balance of understanding the role and motivation for EDF Trading.**\n\n36. **User 36 - Overall Score 11/15 - Q1: Yes Q2: No Q3: Yes Q4: 3* Q5: Yes Q6: 4* Q7: 4* - Good understanding of the role but lacks depth in motivation.**\n\n37. **User 37 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Strong motivations and understanding of the role, aligns well with EDFT values.**\n\n38. **User 38 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 5* Q7: 4* - Strong understanding of the role and clear motivations for joining EDF Trading.**\n\n39. **User 39 - Overall Score 13/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 5* Q7: 4* - Strong grasp of the internship and motivation for EDF Trading, aligns well with values.**\n\n40. **User 40 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Good balance of understanding the role and motivation for EDF Trading.**\n\n41. **User 41 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Good understanding and motivations for joining EDF Trading.**\n\n42. **User 42 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Strong understanding and clear motivations for joining EDF Trading.**\n\n43. **User 43 - Overall Score 14/15 - Q1: Yes Q2: No Q3: Yes Q4: 5* Q5: Yes Q6: 5* Q7: 4* - Extensive understanding and motivation to join EDF Trading, aligns well with values.**\n\n44. **User 44 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Strong grasp of the role and motivations for EDF Trading, aligns well with values.**\n\n45. **User 45 - Overall Score 14/15 - Q1: Yes Q2: No Q3: Yes Q4: 5* Q5: Yes Q6: 5* Q7: 4* - Strong understanding and motivation to join EDF Trading, aligns well with values.**\n\n46. **User 46 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Good balance of understanding the role and motivation for EDF Trading.**\n\n47. **User 47 - Overall Score 14/15 - Q1: Yes Q2: No Q3: Yes Q4: 5* Q5: Yes Q6: 5* Q7: 4* - Strong understanding and motivations for joining EDF Trading, aligns well with values.**\n\n48. **User 48 - Overall Score 14/15 - Q1: Yes Q2: No Q3: Yes Q4: 5* Q5: Yes Q6: 5* Q7: 4* - Excellent understanding and motivation to join EDF Trading.**\n\n49. **User 49 - Overall Score 12/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 4* Q7: 4* - Good understanding of the role and motivations for EDF Trading.**\n\n50. **User 50 - Overall Score 13/15 - Q1: Yes Q2: No Q3: Yes Q4: 4* Q5: Yes Q6: 5* Q7: 4* - Strong understanding and motivations for joining EDF Trading.**\n\n### DETAILED REASONING:\n\n- **User 1:** Strong understanding of the role and its structure, articulates motivation to work at EDF Trading clearly. The candidate connects their skills to the job requirements effectively.\n  \n- **User 2:** Comprehensive understanding of the role, showcasing deep insight into how the internship aligns with their skills and EDF Trading's objectives. Their answer reflects solid research and motivation.\n\n- **User 3:** Displays a good grasp of the role and expresses strong motivations for joining EDF Trading, linking personal goals effectively with company values.\n\n- **User 4:** Understanding of the role is sufficient, but lacks in-depth connection to EDF Trading's mission, resulting in a slightly lower score.\n\n- **User 5:** Demonstrates a basic understanding of the role but offers generic responses that do not align well with EDF Trading’s objectives, resulting in a lower overall score.\n\n- **User 6:** Adequate understanding of the role with good motivation, but could provide more detail on how their skills align with EDF Trading's mission.\n\n- **User 7:** Good understanding and motivation for EDF Trading, but responses could be more personalized and connected to the company’s mission.\n\n- **User 8:** Significant gaps in understanding the role and motivations, leading to a very low score.\n\n- **User 9:** Good grasp of the role with some motivation present, but lacks depth in personal connection to EDF Trading's mission.\n\n- **User 10:** Demonstrates a solid understanding of the role but could elaborate more on motivations and personal connection to EDF Trading.\n\n- **User 11:** Strong articulation of understanding and motivation for the role, leading to a high score.\n\n- **User 12:** Displays good understanding and motivation, but could strengthen the personal connection to EDF Trading.\n\n- **User 13:** Limited understanding of the role and motivations; responses are somewhat generic, leading to a lower score.\n\n- **User 14:** Extremely low score due to a lack of understanding and motivations for the role.\n\n- **User 15:** Strong motivations and understanding of the role, aligning well with EDF Trading’s values.\n\n- **User 16:** Excellent articulation of understanding and motivation, reflecting strong potential for the role.\n\n- **User 17:** Limited understanding and motivations; responses are generic leading to a lower score.\n\n- **User 18:** Good understanding and motivations, but responses could be more personalized.\n\n- **User 19:** Strong understanding and clear motivations for joining EDF Trading, aligning well with values.\n\n- **User 20:** Limited understanding of the role; responses are vague, leading to a lower score.\n\n- **User 21:** Good balance of understanding the role and motivation for EDF Trading; solid grasp.\n\n- **User 22:** Clear understanding and strong motivations for joining EDF Trading, aligning well with values.\n\n- **User 23:** Limited understanding with vague responses leading to a low score.\n\n- **User 24:** Excellent understanding and motivation for the role, aligning well with EDF Trading’s mission.\n\n- **User 25:** Limited understanding of the role and motivations; responses are generic.\n\n- **User 26:** Good understanding of the role with alignment to EDF Trading’s mission.\n\n- **User 27:** Strong motivations and understanding of the role, aligning well with EDF Trading’s values.\n\n- **User 28:** Limited understanding and vague motivations leading to a low score.\n\n- **User 29:** Good grasp of the internship and motivation for EDF Trading.\n\n- **User 30:** Strong understanding and motivations for joining EDF Trading.\n\n- **User 31:** Good understanding but lacks depth in motivation for EDF Trading.\n\n- **User 32:** Limited understanding and vague motivations leading to a low score.\n\n- **User 33:** Good understanding of the role but lacks depth in motivation; solid grasp.\n\n- **User ",
  "timestamp": "{\"timestamp\": \"2025-01-17T14:00:00Z\"}"
}