{
  "client": "EDF Trading - Internship",
  "jobDescription": "Commercial Summer Internship\nOverview of EDF Trading (EDFT)\nEDF Trading is a specialist in the wholesale energy markets, providing a gateway to energy markets for buyers and sellers of a wide range of energy commodities. We are part of the EDF Group, a global leader in low-carbon energies.\n\nEDFT are at the fore-front of the European power and gas markets. We apply our reach, corporate strength, physical and financial market presence to add value to the assets of the EDF Group and our third party customers.\n\nOur culture\nWe are proud of our ethnic and cultural diversity. We are high-performing people working together to achieve common goals. Innovative and flexible in our thinking, we are able to adapt and change, which is critical to our success. Respect is our foundation, it's what empowers our employees to unlock their full potential. Our people are encouraged to speak up, and we listen, which drives collective understanding, collaboration and achievement.\n\nInternship overview\nOur summer internship programme provides you with an exciting opportunity to develop and utilise new skills, explore interesting fields and undertake challenging and innovative work within a fast-paced trading environment.\n\nWe typically have opportunities across:\n\nEnergy commodities trading\nMarket risk\nAnalytics\nQuant Risk\nOrigination\nWhat you can expect\nA structured paid summer internship programme at our Global Headquarters in London.\n\nThis typically provides:\n\nHands-on participation in a real business project\nComprehensive industry specific and personal and professional skills training\nOpportunities to build your network across the business globally\nRegular opportunities to interact with our commercial teams and leaders\nOngoing check-ins and continuous coaching from your manager and mentor\nSocial activities\nEnd of placement presentation to our C-Suite and key stakeholders\nSuccessful completion of a summer internship with EDFT provides you with the potential to be offered a place on our 2 year Commercial Graduate Programme.\n\nWhat we are looking for\nEDFT constantly seeks curious, enthusiastic and commercially astute students with an entrepreneurial spirit who are eager to explore a career in energy markets.\n\nWe are ideally looking for individuals with:\n\nAn interest in the energy industry\nThe ability to think critically\nStrong quantitative and qualitative analytical skills\nExcellent interpersonal skills\nKnowledge of programming languages\nCandidates must:\n\nBe available to start in Summer 2026\nBe based in our London office\nGraduating in 2026 or 2027\nHave a right to work in the UK",
  "totalCandidates": 1,
  "candidates": [
    {
      "User": "1",
      "Question 1": "hands on work with experienced professional teaching in a social environment. working within the energy market and enhancing my understanding and confidence in management and finance",
      "Question 2": "the work environment seems to be most welcoming and friendly, not making fell afraid to ask a question or for help",
      "Question 3": "the variety of tasks presented. whereas other companies will just put you at a desk all summer, EDF Trading seems to help out new entries and provide meaningful training and assistance with interesting work"
    }
  ],
  "analysis": "1. **User 1 - Overall Score 9.00/15 - Q1: 3.00* Q2: 3.00* Q3: 3.00* - **\n\nThe candidate shows a general grasp of the internship but could enhance their responses with more detailed connections to EDF Trading's values and opportunities.",
  "timestamp": "{\"timestamp\": \"2025-01-17T14:00:00Z\"}"
}