{
  "client": "EDF Trading - Internship",
  "jobDescription": "Client specifics",
  "totalCandidates": 33,
  "candidates": [
    {
      "User": "1",
      "University": "Nottingham, University of",
      "Course": "Finance",
      "What is your understanding of this role based on the job description?": "From my understanding, this internship provides exposure to the wholesale energy markets, where EDF Trading plays a key role as a gateway for buyers and sellers of energy commodities. The role is about learning how trading, market risk, analytics, and origination come together to add value both to the EDF Group and to third-party customers.\n\nAs an intern, I would gain hands-on experience in a fast-paced trading environment—supporting decision making, analysing data, and developing models or insights that help the business manage risk and identify opportunities. It’s not just about technical skills, but also about adapting quickly, thinking innovatively, and collaborating within a diverse and high-performing team.\n\nIn short, I see the role as an opportunity to contribute to EDFT’s market activities while building a strong foundation in energy trading, risk, and analytics",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it sits at the intersection of finance, energy, and global markets, all areas I’m genuinely passionate about. I enjoy competitive, high-performance environments, whether that’s in sport or in my studies, and I see trading as the professional equivalent: fast-paced, analytical, and demanding clear decision-making under pressure.\n\nEDF Trading really appeals to me because of its leading role in the European power and gas markets, its global reach, and the chance to contribute to a business that’s part of the wider EDF Group, which is shaping the future of low-carbon energy. For me, this is the ideal place to learn from some of the best people in the industry while building the skills to contribute meaningfully in trading and risk.",
      "What is it about this Internship position that stands out for you?": "What really stands out for me about this internship is how closely it aligns with both my personal drive and my career goals. I’m someone who thrives in competitive, high-pressure environments. Whether that’s from my football and boxing background, or the way I approach investing, trading feels like a natural extension of that mindset.\n\nThe idea of being in a fast-paced market setting, where analysis and decision-making actually drive results, excites me. I also like that EDF Trading encourages people to speak up and contribute ideas. That resonates with me, because I don’t just want to sit back and observe, I want to be in an environment where I can challenge myself, learn from experts, and start adding value."
    },
    {
      "User": "2",
      "University": "Birmingham, University of",
      "Course": "Chemical Engineering",
      "What is your understanding of this role based on the job description?": "This internship is designed to expose one to the energy trading industry, offering opportunities across trading, market risk, analytics, quant risk, and origination.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it combines leadership in low carbon energy with a strong presence in global markets, which aligns with my passion for sustainable energy. My background in Chemical Engineering and experiences in both research and financial analysis have given me strong technical and analytical skills that I wish to apply in this internship. I’m drawn to EDFs culture of innovation and collaboration, and I see this internship as an excellent opportunity to contribute while developing the skills needed for a career in energy markets.",
      "What is it about this Internship position that stands out for you?": "What stands out to me about this internship is the opportunity to gain hands on experience in the industry of energy trading while being supported by structured training, mentoring, and exposure to senior leaders. I’m particularly drawn to the wide variety of opportunities across trading, risk, analytics, and origination, which would allow me to apply my technical and analytical skills in different situations."
    },
    {
      "User": "3",
      "University": "Exeter, University of",
      "Course": "Other",
      "What is your understanding of this role based on the job description?": "This role offers candidates flexibility to gain exposure across multiple areas of the business, including risk analysis, energy commodities trading, and analytics. Typical tasks could involve conducting market research, preparing reports on market trends, or supporting model development to forecast supply and demand or assess risk.\n\nThe programme is designed for interns to enter with an open mind, explore different sectors, and identify where they may wish to specialise. Alongside hands-on work, candidates benefit from training, mentoring from managers, and opportunities to network with specialists across the company. A key element of the internship is completing a project which is then presented to senior stakeholders to demonstrate findings and recommendations.",
      "Why do you want to work for EDF Trading?": "EDF Trading's culture of fostering innovation, flexible thinking, and entrepreneurialism aligns closely with my own approach to learning and problem-solving. I enjoy applying creative solutions, taking initiative, and identifying opportunities–skills I have honed through academic and commercial projects to deliver high-quality results. Furthermore, the company’s emphasis on respect and client trust resonates with my own strong ethical values, reinforcing that EDF Trading is a place where I can thrive and contribute meaningfully.\n\nHaving completed an internship at an EV charging startup, I have developed a strong interest in macroeconomics and global energy markets, alongside a deep appreciation for the importance of sustainable energy implementation. To nurture this passion, I actively follow developments in global energy markets and innovations in clean energy, which has only furthered my curiosity. EDF Trading embodies both of these aspects, given its pivotal role in helping businesses meet sustainability targets and its management of thousands of solar and wind farms worldwide. This gives me confidence that working here would allow me to contribute to projects with a positive environmental impact while deepening my understanding of global energy markets through direct exposure in a highly professional setting.",
      "What is it about this Internship position that stands out for you?": "What stood out to me about this internship is the opportunity to gain exposure across such a diverse range of sectors within the company. As someone passionate about global energy markets and the energy industry as a whole, but still exploring which area I want to specialise in, this breadth of experience would be an ideal way to discover where my skills and interests align most.\n\nThe opportunity to complete a hands-on project and present it to senior stakeholders is particularly exciting, as it demonstrates that the work has a tangible impact on the company’s processes. I have experience doing this during a previous internship, where I presented a project to senior leadership and found it highly motivating to contribute directly to decision-making. This experience encouraged me to be innovative and produce high-quality, impactful results, and even led to direct commendation from the CEO. I would be eager to take on a similar opportunity at EDF Trading\n\nMost importantly, the nature of work across the sectors in this internship–such as conducting market research within trading, building models in analytics, and using models to assess risk in quant risk–aligns closely with my background as a STEM student. I have experience handling complex datasets, conducting extensive research in both academic and commercial settings, and refining my quantitative skills through mathematically rigorous work. I am confident in my ability to deliver high-quality results, having received a Dean’s Commendation for my first-year performance at university and other recognitions for academic achievement. I would be highly motivated to apply these skills in the high-pressure, dynamic, and challenging professional environment that EDF Trading provides. Additionally, the opportunity to be mentored by an experienced manager throughout the internship assures me that this would be an excellent environment to further develop my professional skills early in my commercial career."
    },
    {
      "User": "4",
      "University": "Warwick, University of",
      "Course": "Mathematics/Statistics",
      "What is your understanding of this role based on the job description?": "The Commercial Summer Internship role is an opportunity to jump right into the world of energy markets. In the internship, I’d be able to apply my technical and commercial skills to deliver real value, taking ownership of a real project from start to finish and presenting my work to business stakeholders. The internship would also offer structured training and regular coaching from a network of experienced industry professionals, accelerating the development of my technical skills and understanding of the energy sector. This role also represents an exciting first step of a career in energy trading, with the potential to continue my journey at EDF Trading through its Commercial Graduate Programme.",
      "Why do you want to work for EDF Trading?": "First and foremost, EDF Trading stands out to me as an organisation where I can grow and develop in my career. The firm’s forward focus, culture of team spirit, and commitment to diversity and inclusion deeply resonate with me - reaffirming to me that EDF Trading is one of the best places to embark on my career journey. Furthermore, EDF’s goal of helping Britain achieve net zero is one that I certainly share, and the opportunity to support this mission through a career at EDF Trading is one that I find to be both exciting and meaningful.",
      "What is it about this Internship position that stands out for you?": "The key aspect of the Commercial Summer Internship that draws me to the position is its early responsibility - the opportunity to learn through hands-on experience. Having spoken to previous EDF Trading interns, it’s clear to me that the chance to apply my mathematical and statistical background to a real business project at EDFT is a uniquely valuable one and an exciting challenge to take on. They also emphasised the supportive environment at EDFT, where I would feel encouraged to ask questions and refine my understanding of the industry. I am excited by the personal and professional development that I would be able to gain in this role, as well as the opportunity to further explore my interest in the energy sector at EDF Trading."
    },
    {
      "User": "5",
      "University": "Manchester Metropolitan University",
      "Course": "Finance",
      "What is your understanding of this role based on the job description?": "From what I understand, this internship gives me the chance to get hands-on experience within a trading environment and learn more about how EDF Trading works across energy markets. It is not just about observing but actually contributing to real projects in areas like trading, risk and analytics. The programme also offers training, mentoring and networking, which I see as a way to build both technical and personal skills. The end of placement presentation to senior leaders also shows that interns are expected to take ownership and add value.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it is part of a global leader in low-carbon energy and has a strong presence in the European power and gas markets. I am studying Accounting and Finance, and from my experiences so far in audit, client support and data analysis, I enjoy working with numbers, solving problems and delivering results in a fast-paced setting. EDFT’s culture of respect, innovation and collaboration appeals to me as I know from my own roles that a supportive and inclusive environment allows you to perform at your best.",
      "What is it about this Internship position that stands out for you?": "What stands out most to me is the balance of challenge and support. The chance to work on real business projects and present to senior stakeholders is exciting because it means the work matters and has impact. At the same time, having training, mentoring and check-ins shows that interns are supported in their development. I am also drawn to the variety of opportunities across trading, analytics and risk, which fits my interest in applying my analytical and problem-solving skills to complex financial and market data. Finally, I like that this internship can lead into a graduate programme, as I am keen to start building a long-term career in the energy markets."
    },
    {
      "User": "6",
      "University": "Essex, University of",
      "Course": "Data Science",
      "What is your understanding of this role based on the job description?": "Yes",
      "Why do you want to work for EDF Trading?": "Yes",
      "What is it about this Internship position that stands out for you?": "Yes"
    },
    {
      "User": "7",
      "University": "Cardiff University",
      "Course": "Law",
      "What is your understanding of this role based on the job description?": "The Commercial Summer Internship at EDF Trading offers the chance to immerse myself in the energy markets while working on meaningful projects that mirror the real challenges faced by trading, risk, analytics, and origination teams. It’s a structured programme that combines practical, day-to-day involvement in a fast-moving trading environment with training that sharpens both technical abilities, like data analysis, problem solving, and coding, and broader professional skills such as communication, teamwork, and presenting to senior leaders. What stands out is the opportunity to learn directly from experienced professionals, build a strong network across the business, and gain insight into how EDFT creates value in the European power and gas markets. To me, the internship is about more than just short-term experience, it’s a chance to test my curiosity and commercial mindset in a competitive industry, while opening a potential route into the Commercial Graduate Programme.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it brings together the kind of analytical, commercial, and ethical challenges I have enjoyed tackling in both my degree and consultancy experience. At university, I thrived on solving problems that required evaluating complex scenarios and anticipating risks, and I built on this when reviewing contracts at a consultancy, where I had to identify one-sided terms, advise the business team, and think ahead to the implications for future tenders. What excites me about EDFT is the chance to apply these same skills in the context of fast-moving energy markets, where critical thinking and sound judgment are essential to balancing financial, commercial, and reputational considerations. EDFT’s culture of respect and collaboration also appeals to me, as I have seen the value of diverse perspectives through debating, mooting, and working in multicultural teams, and I know I learn best in environments where people are encouraged to share ideas openly. Ultimately, I want to join EDF Trading because it offers the opportunity to grow in a competitive industry that has global importance, while developing the commercial instincts and resilience I have been building throughout my academic, professional, and extracurricular experiences.",
      "What is it about this Internship position that stands out for you?": "What stands out to me about this internship is the chance to apply the skills I’ve built through a mix of academic, professional, and extracurricular experiences to a fast-moving trading environment. In consultancy and legal internships, I enjoyed analysing detailed contracts and spotting risks, then translating them into clear, practical advice, a skill directly relevant to market risk and origination at EDF Trading. Through roles such as Vice President of External Relations at AIESEC and CMS Campus Ambassador, I’ve also had to engage stakeholders, secure sponsorships, and present persuasively, which mirrors the client-facing and collaborative nature of trading. Beyond work, debating, public speaking, and performing with a dance group have all sharpened my ability to stay composed and communicate under pressure. These qualities are essential in fast-paced markets. For me, this internship stands out because it is not only a platform to test these skills in a commercial setting but also a unique opportunity to grow in a sector that is central to global challenges and innovation."
    },
    {
      "User": "8",
      "University": "Newcastle University",
      "Course": "Economics",
      "What is your understanding of this role based on the job description?": "The role involves being placed within a specific team, such as Trading, Market Risk, Analytics or Origination where I would be given real responsibility, likely working on a live business project. The focus would be on applying quantitative and critical thinking skills to solve problems Whether that's analysing market data, assessing risk, developing trading strategies, or supporting the development of energy deals. The internship is structured to accelerate professional development through training, networking, and mentorship. A key outcome is the opportunity to present my work to senior leadership. Ultimately, the role is a gateway to becoming a commercial professional in the fast-paced and critical energy sector",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it operates at the fascinating intersection of global markets and the transition to a low-carbon future. My time at university has given me the framework to understand these complex systems on top of that my time analysing credit risk at NatWest showed me how much I enjoy applying analytical thinking to tangible, high-impact problems. Furthermore, the company culture truly stands out. The emphasis on  diversity as well as innovative and flexible thinking strongly resonates with my experience leading and coaching at Camp America. I saw first-hand how a respectful and collaborative environment is the key to solving complex problems under pressure. I am not just looking for any internship, I am looking for a place where I can learn from diverse experts, contribute to meaningful work.",
      "What is it about this Internship position that stands out for you?": "What really stands out to me is how the internship is genuinely designed as a two-way partnership. It’s clear that EDFT doesn’t just see interns as temporary help, you’re inviting us to become part of the team, to learn meaningfully, and to grow. The hands-on involvement in a real business project is huge for me. I learn by doing, and the chance to take ownership of something tangible, especially in a field as impactful as energy, feels like an incredible opportunity to contribute meaningfully while finding out where my skills fit best. The idea of having a mentor, learning directly from commercial teams, and even presenting to leadership doesn’t just sound like great experience, it makes me feel like my development and perspective are truly valued."
    },
    {
      "User": "9",
      "University": "Lancaster University",
      "Course": "Economics",
      "What is your understanding of this role based on the job description?": "From the job description, I understand this role at EDF Trading focuses on supporting the trading teams with market analysis, risk management, and the smooth execution of energy transactions. For me, it’s a chance to apply the analytical and problem-solving skills I’ve developed through Economics, Politics & Philosophy, while gaining first-hand experience in fast-moving global markets. I see it as an opportunity to contribute to EDF’s commercial decisions and build a strong foundation in trading and risk.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it represents the intersection of markets, strategy, and global impact that excites me most. With my studies in Economics, Politics & Philosophy, I’ve developed a deep interest in how financial decisions shape not just businesses, but societies. EDF Trading’s role in navigating complex energy markets while supporting the transition to a sustainable future resonates strongly with me. I’m motivated by the chance to learn in an environment that is fast-paced, intellectually challenging, and commercially driven, while also being part of a company whose work has a tangible effect on people’s everyday lives. For me, joining EDF Trading is not just about developing technical and professional skills, but about contributing to something that matters on a larger scale.",
      "What is it about this Internship position that stands out for you?": "What stands out to me about this internship is the chance to be directly exposed to the pace and decision-making of real energy markets. I’m drawn to environments where analysis, strategy, and teamwork come together under pressure, and this role offers exactly that. The opportunity to contribute to EDF Trading’s commercial activities while learning from professionals at the heart of global markets is something I find both exciting and invaluable for my development."
    },
    {
      "User": "10",
      "University": "Reading, University of",
      "Course": "Economics",
      "What is your understanding of this role based on the job description?": "I understand this internship as an opportunity to explore EDF Trading’s role at the centre of the European energy markets, gaining exposure to areas such as trading, risk, analytics and origination. The programme is designed to develop commercial awareness, analytical ability and teamwork through structured projects, training and mentoring. With my economics background, I bring strong quantitative and critical thinking skills to analyse market trends and understand the drivers of supply, demand and pricing.",
      "Why do you want to work for EDF Trading?": "With my economics background, I am particularly interested in how market forces, risk management and trading strategies shape the energy transition. Although my professional experience is in retail, it has given me transferable skills such as communication, adaptability and problem-solving in fast-moving environments.",
      "What is it about this Internship position that stands out for you?": "With my economics background, I am particularly interested in how market forces, risk management and trading strategies shape the energy transition. Although my professional experience is in retail, it has given me transferable skills such as communication, adaptability and problem-solving in fast-moving environments."
    },
    {
      "User": "11",
      "University": "Birmingham City University",
      "Course": "Economics",
      "What is your understanding of this role based on the job description?": "Based on the job description I understand that the commercial summer internship provides a structured programme to gain practical experience within the global energy trading market. Offering exposure to key areas such as market risk, energy commodities training and origination, where I'd have the opportunity to contribute to real business projects and gain an insight to how EDF manages and trades energy products, power and gas.",
      "Why do you want to work for EDF Trading?": "EDF's mission to be a global leader in low carbon energy aligns with my commitment to sustainable and innovative energy solutions, similarly to its vision of providing a global gateway to energy markets whilst creating long term value through responsible trading. I'm also inspired by the core values of collaboration, innovation and respect in which foster an inclusive culture where diverse perspectives drive progress. The chance to contribute to projects such as market risk or trading excites me, along with helping to drive the shift to a low carbon future.",
      "What is it about this Internship position that stands out for you?": "The idea of gaining an hands on experience in a fast paced environment whilst contributing to real business projects is what initially stands out to me. I'm particularly drawn into the combination of a structured training programme, exposure to key areas and the chance to work with and learn from industry experts. The final presentation to senior stakeholders offers an ideal platform to develop my interpersonal, analytical and commercial skills. I see this internship as an opportunity to apply and grow within a forward thinking organisation and help shape the future of sustainable energy trading."
    },
    {
      "User": "12",
      "University": "Coventry University",
      "Course": "Finance",
      "What is your understanding of this role based on the job description?": "It’s a summer internship which can be explored in finance or business management.",
      "Why do you want to work for EDF Trading?": "My values align with the fact it’s a low carbon energy company and a great place to learn valuable skills while developing my existing skills.",
      "What is it about this Internship position that stands out for you?": "It’s the location and what’s included within the internship. I want to work in either business or finance and this would allow me to experience some of that and continue my passion for it."
    },
    {
      "User": "13",
      "University": "Imperial College London",
      "Course": "Economics",
      "What is your understanding of this role based on the job description?": "From the job description, I understand that this internship is an opportunity to gain first-hand experience in the energy markets within a fast-paced trading environment. It involves working on a real business project while receiving training and guidance, which allows interns to contribute meaningfully to the team while developing technical, analytical, and professional skills. The role covers areas such as trading, market risk, analytics, and origination, so it’s about being exposed to different aspects of how energy commodities are priced, traded, and risk-managed. The structured nature of the programme, alongside mentorship and the chance to present to senior leaders, shows that the focus is not only on adding value to the business but also on investing in interns’ long-term development.",
      "Why do you want to work for EDF Trading?": "I am drawn to EDF Trading because of its reputation as a leading player in the European energy markets and its clear commitment to innovation and adaptability. The focus on providing a gateway to global energy markets, combined with EDF’s strength in low-carbon energy, really excites me because it reflects the direction the energy industry is moving in, towards more sustainable and efficient systems. I also find the culture at EDF Trading appealing. The emphasis on respect, collaboration, and encouraging people to speak up aligns with how I work best: in environments where diverse perspectives are valued, and ideas can be openly exchanged.\nMy previous experiences have helped me understand the importance of adaptability and problem-solving in commercial settings. During my internship at Société Générale, I worked on the FX swaps trading desk where I had to quickly absorb market information, understand client needs, and think critically under time pressure. Similarly, at Edmond de Rothschild, I gained insight into asset management and the role that data and analysis play in decision-making. These experiences gave me a taste of how dynamic financial markets operate, and EDF Trading stands out as the perfect place to build on this by applying my skills in a sector as vital as energy.",
      "What is it about this Internship position that stands out for you?": "What excites me most about this internship is the combination of hands-on project work and structured development. I like that interns are trusted with meaningful responsibilities while also being given mentorship and training to grow. The opportunity to engage with teams across trading, risk, and analytics is particularly appealing because I enjoy working with both data-driven and commercial aspects of a business. For example, in my degree I have developed strong quantitative and programming skills, and in my internships I’ve applied them to financial markets. Being able to bring this into the energy space, where market dynamics are influenced by such a unique blend of macroeconomics, supply-demand fundamentals, and policy, makes the role especially attractive.\nI also find the end-of-placement presentation to the C-Suite motivating. It shows that the company values interns’ contributions and provides a platform to demonstrate what has been achieved. Knowing that strong performance in the summer could lead to a place on the graduate programme is also reassuring, as it demonstrates EDF Trading’s commitment to investing in long-term careers. Overall, it’s the mix of challenge, exposure, and support that makes this internship stand out for me."
    },
    {
      "User": "14",
      "University": "Manchester Metropolitan University",
      "Course": "Accountancy",
      "What is your understanding of this role based on the job description?": "This role is about gaining hands-on experience in the energy markets, working on real projects within trading, risk, or analytics. From the description, I understand it involves analysing data, supporting decision-making, and learning directly from experienced teams in a fast-paced environment, while building the skills needed for a future career in energy trading.",
      "Why do you want to work for EDF Trading?": "I want to work at EDF Trading because it’s a leader in the European energy markets and offers exposure to both physical and financial trading. I’m really interested in how data, risk analysis, and commercial decisions come together in this sector. With my background in accounting, finance, and developing data skills, I see EDFT as the best place to apply what I’ve learned and grow in an environment that values innovation and collaboration.",
      "What is it about this Internship position that stands out for you?": "What stands out to me is the chance to work on real projects in trading, risk, and analytics while learning directly from experienced teams. The structured training, mentoring, and end-of-placement presentation also appeal to me because they’ll push me to grow both technically and professionally, and give me a real insight into a career in energy markets."
    },
    {
      "User": "15",
      "University": "Queen Mary University of London",
      "Course": "Aerospace Engineering",
      "What is your understanding of this role based on the job description?": "The Commercial Summer internship at EDF Trading provides a 10-week introduction to energy markets, with opportunities to work in areas such as trading ,risk, and analytics. The role focuses on analysing datasets, modelling market behaviours and supporting commercial decisions in a fast-paced environment, requiring strong quantitative and problem-solving skills as well as teamwork.",
      "Why do you want to work for EDF Trading?": "EDF Trading is at the intersection of the global energy markets and the transition to a sustainable future. EDF's reputation as a leading energy trader, combined with its commitment to decarbonisation, makes it an exciting place to apply my skills while contributing to a meaningful goals. Coming from an Aerospace Engineering background, I am deeply motivated by challenges that require analytical rigour and system-level thinking. EDF Trading's focus on managing risk, optimising portfolios and trading across fuels and power markets aligns closely with my interest in how energy flows are balanced in real time. I am drawn to the dynamic, high-responsibility environment where I can apply my quantitative background to support impactful commercial decisions.",
      "What is it about this Internship position that stands out for you?": "The combination of structured training, real project responsibility and exposure to different commercial teams is what excites me about this opportunity. The chance to rotate across areas such as analytics, risk and trading is particularly appealing, as it allows me to apply my technical background while being able to develop a well-rounded understanding of the energy market. The emphasis on mentorship, networking, and the opportunity to  present to senior leaders is what draws me to this position. The blend of technical challenges, commercial exposure and personal development makes this a unique opportunity for me to explore a career within the energy markets."
    },
    {
      "User": "16",
      "University": "Exeter, University of",
      "Course": "Economics",
      "What is your understanding of this role based on the job description?": "This internship offers an opportunity to gain exposure to the fast-paced environment of energy trading and commercial markets. Based on the job description, the role is structured around contributing to business projects in areas like trading, analytics, market risk, and origination. Alongside this, there’s structured training on both technical and professional skills, as well as regular mentoring, feedback, and opportunities to build relationships across the company.\nIt’s clear that EDF Trading values analytical skills, commercial awareness, and adaptability. These align with my academic background in Economics at the University of Exeter, and with my experiences in finance-related simulations with Citi and J.P. Morgan, and insight internships at PWC. The emphasis on collaboration and innovation suggests that the role requires problem-solving and teamwork. \nAdditionally, EDF Trading is seeking curious individuals who are interested in how energy markets work, particularly in a fast-paced, evolving sector like low-carbon energy. That really appeals to me. The fact that this internship also offers a potential route into the graduate programme is a big motivator, as I’m looking for a long-term career in this space I'm excited by the opportunity to gain insight into how energy products are traded in a dynamic, low-carbon economy.",
      "Why do you want to work for EDF Trading?": "What sets EDF Trading apart, and why I’m particularly interested in working here, is its unique position at the intersection of energy markets and financial trading. By optimising its physical energy assets and controlling market risk, EDFT plays a strategic role in supporting the Group's low-carbon goals, in contrast to many trading firms only concentrate on financial gain.\nWhat stood out to me during my research was EDFT’s role in shaping the European energy landscape. I found it fascinating that EDFT manages over thousands of terawatt-hours of power and gas annually, more than the total annual consumption of France. I find it exciting how EDFT operates at such a large scale while managing the technical challenges of both physical energy logistics and market risk.\nI also discovered EDFT’s work in environmental products trading which included carbon allowances and renewable certificates. As Economics student with an interest in sustainable finance and solutions to climate change, I’m excited by the opportunity to work with a team actively involved in shaping how these products are traded and integrated into risk strategies.\nFinally, I admire how EDF Trading combines high performance with a collaborative and respectful culture. This is something I value deeply from my experience as Competition Captain for the University of Exeter Swim Team, as well as from my role as Finance Director of the Young Enterprise Team. From these experiences, I’ve learnt that I perform best when working in a team in fast-paced environments where people are encouraged to share ideas and take on challenges, something which EDFT clearly values.",
      "What is it about this Internship position that stands out for you?": "What really stands out to me about this internship is the combination of invaluable experience and mentorship. It’s not just about observing or doing small tasks, the chance to work on real business projects in areas like trading, analytics, or market risk is incredibly appealing. \nFurthermore, what really appeals to me is how EDF Trading is how it invests in personal growth.  Having ongoing coaching and opportunities to connect with experienced leaders is an environment in which I can truly learn and develop my skills, be challenged, and grow both professionally and personally."
    },
    {
      "User": "17",
      "University": "Reading, University of",
      "Course": "Computer Science and IT",
      "What is your understanding of this role based on the job description?": "his role offers the opportunity to contribute directly to EDF Trading’s work in energy markets by applying quantitative, analytical, and programming skills to real business challenges. As an intern, I would gain hands-on experience in areas such as trading, risk, or analytics, while developing technical solutions, evaluating market data, and supporting decision-making.",
      "Why do you want to work for EDF Trading?": "I am drawn to the firm’s combination of market expertise, corporate strength, and commitment to innovation. The opportunity to work within a diverse, collaborative culture where ideas are valued aligns with my own values and career ambitions. I am particularly motivated by EDFT’s ability to bridge physical and financial markets, which would allow me to apply my technical and analytical background to projects that contribute to both commercial success and the energy transition.",
      "What is it about this Internship position that stands out for you?": "What excites me most about this internship is the chance to take part in a structured programme where I can work on meaningful projects while learning directly from experienced professionals in energy trading. The blend of technical challenges, market exposure, and professional training is exactly what I am seeking at this stage in my career. I am especially motivated by the end-of-placement presentation to senior leaders, which provides a tangible opportunity to demonstrate impact and gain feedback. The possibility of progressing to the Commercial Graduate Programme makes this internship an ideal pathway to build a long-term career in energy markets."
    },
    {
      "User": "18",
      "University": "Birmingham City University",
      "Course": "Business",
      "What is your understanding of this role based on the job description?": "This role is about gaining hands-on exposure to the energy markets through a structured internship within EDF Trading’s commercial teams. From the job description, I understand that interns contribute directly to projects that support trading, risk management, analytics, or origination. That means working with data to generate insights, learning how trading decisions are made, and supporting the business in managing both physical and financial energy products.\n\nThe role also places a strong emphasis on learning through industry training, mentorship, and exposure to senior stakeholders. It’s not just about observing but actively contributing, whether by analysing market trends, preparing reports, or supporting risk and trading teams with research.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it combines two things I’m really motivated by: the energy sector and dynamic commercial environments. EDFT is recognised as a leader in the European power and gas markets, and as part of the EDF Group, it plays a central role in the transition to low-carbon energy. This balance of global strength and focus on innovation makes it an exciting place to learn.\n\nWhat stands out to me is EDFT’s culture of adaptability and respect. From the description, it’s clear that people are encouraged to think creatively, work collaboratively, and bring forward ideas. I know from my own entrepreneurial experience that these qualities drive results in fast-paced settings, and I’d value working somewhere that actively fosters them.\n\nI’m also drawn to the structure of the internship itself, being able to work on real projects, engage directly with commercial teams, and present to senior leadership. That exposure shows EDFT’s commitment to developing young talent and giving interns real responsibility, which is exactly what I am looking for in the early stages of my career.",
      "What is it about this Internship position that stands out for you?": "What stands out most about this internship is the chance to gain real, practical experience in energy trading while being part of a business that is shaping the future of the sector. The opportunity to rotate across areas like trading, risk, and analytics means I’ll not only build technical skills but also understand how the different pieces of the business connect.\n\nI’m especially drawn to the mix of structured training and on-the-job learning. The idea of working on a project that has real business impact, while also developing presentation and communication skills through an end-of-placement presentation, makes the internship feel both challenging and rewarding.\n\nAnother key factor is the exposure to senior leaders and the chance to build a network within a global organisation. For me, this isn’t just an internship but a step into a long-term career in energy markets, and EDFT’s commitment to developing interns into potential graduate hires really sets this position apart."
    },
    {
      "User": "19",
      "University": "University College London",
      "Course": "History",
      "What is your understanding of this role based on the job description?": "I will be exposed to the complex nature from a business point of view of the vital Energy industry.",
      "Why do you want to work for EDF Trading?": "Brand name & stability",
      "What is it about this Internship position that stands out for you?": "The EDF name on my future resume"
    },
    {
      "User": "20",
      "University": "Lancaster University",
      "Course": "Economics",
      "What is your understanding of this role based on the job description?": "This role involves supporting EDF Trading’s commercial teams in analysing energy markets, managing data, and assisting in the optimisation of trading strategies. It requires strong analytical and numerical skills to interpret market trends, contribute to forecasting, and support decision-making in fast-moving commodity markets such as power, gas, and environmental products. The role also involves working with trading systems, coordinating with different teams, and ensuring accurate reporting and risk management to deliver value to EDF Group.",
      "Why do you want to work for EDF Trading?": "I am motivated to join EDF Trading because it operates at the centre of global energy markets, combining trading expertise with the backing of a world-leading low-carbon energy group. I am particularly drawn to the company’s commitment to sustainability and its active role in environmental products, carbon markets, and renewable integration. This aligns with my academic background in Business Economics and my internship experience in demand planning, where I developed strong forecasting and problem-solving skills. EDF Trading offers the ideal environment to apply and expand these skills while contributing to innovative solutions in a rapidly changing energy landscape.",
      "What is it about this Internship position that stands out for you?": "What stands out most is the opportunity to gain hands-on experience in global energy trading while learning from experienced professionals in an asset-backed, fast-paced environment. I am particularly excited by the chance to combine quantitative analysis with commercial decision-making and to see how data is transformed into trading strategies that directly impact the energy market. The structured exposure to different areas of the business, from risk management to optimisation, makes this internship unique, and I see it as the perfect opportunity to build a foundation for a career in trading and energy markets."
    },
    {
      "User": "21",
      "University": "Birmingham, University of",
      "Course": "Electronic and Electrical Engineering",
      "What is your understanding of this role based on the job description?": "This internship provides an invaluable opportunity to gain hands-on exposure to EDF Trading’s core commercial activities, including energy commodities trading, market risk and data analysis. I understand that interns will work on real projects within a fast-paced environment, applying their technical skills to support a wider goal. The role also offers structured training, mentoring and opportunities to network across the organisation, culminating in a final presentation to senior stakeholders. Overall, the position offers a balance between technical analysis, commercial awareness and collaboration with a potential graduate role offer.",
      "Why do you want to work for EDF Trading?": "I want to join EDF Trading because of its reputation as a leading specialist in energy markets and its position at the forefront of Europe’s transition to low-carbon energy, a topic I am passionate about. I am especially drawn to EDF Trading’s combination of financial market expertise and technical knowledge of energy systems, which aligns with my engineering background. I am eager to gain experience in a financial-focused role where I can apply my technical skills in programming and data analysis to real commercial challenges. The company’s culture of innovation and collaboration also appeals to me, as I value environments where ideas are encouraged and people are supported to develop. Working at EDF Trading would give me the opportunity to grow professionally while contributing to the future of sustainable energy markets.",
      "What is it about this Internship position that stands out for you?": "What stands out most to me is the opportunity to make a real impact through real, meaningful projects while gaining real exposure to energy trading and risk management, culminating in a final presentation to senior stakeholders. This unique opportunity provides the chance to demonstrate impact and receive high-level feedback, which is rare for internships. I am particularly excited by the structured nature of the programme, knowing that support is built in through training and mentorship. Beyond the internship itself, the potential progression into a graduate role makes this an excellent opportunity to build a long-term career in energy markets with EDF."
    },
    {
      "User": "22",
      "University": "Exeter, University of",
      "Course": "Physics",
      "What is your understanding of this role based on the job description?": "This summer internship allows an insight into careers in energy markets, looking at trading, analysing risk and how the energy trading is organised. The internship gives direct training and allows for students to undertake and present a real business project.",
      "Why do you want to work for EDF Trading?": "My personal background is physics, and I have a great interest in energy generation, with a special interest in nuclear energy. I am also intrigued by the trading world, and would love to learn more about things such as risk. Working for EDF Trading would give me a great insight into the energy consumption and trading world and allow me to understand what happens after energy is generated, giving a wider context to what I have learnt with physics. I think I would make a great asset due to my deep understanding and knowledge of energy, as well the soft skills I have gained from my course, such as critical thinking and communication.",
      "What is it about this Internship position that stands out for you?": "The real business project is what stands out most to me, where I would be able to contribute hands-on and partake in the industry, as I believe this is the greatest benefit of Internships such as this. As before, I am also excited to learn about the wider context of energy production and see how the different branches of EDF."
    },
    {
      "User": "23",
      "University": "Imperial College London",
      "Course": "Civil Engineering",
      "What is your understanding of this role based on the job description?": "As I understand it, this internship will provide opportunities to learn more about different business lines, ranging from energy commodities trading to origination. While the divisions are disparate in function, the roles all involve the same core skillset. This skillset includes the ability to solve problems with outside-the-box thinking, explore different perspectives, and drive innovation in each field. Moreover, the divisions all contribute to a shared goal: maximising profits from the wholesale energy market; they are interdependent on one another. For example, the energy commodities trading team generates profit from the buying and selling of financial energy products. The market risk team helps regulate the risk taken by the trading team, analytics and quantitative risk employees help create models, while the origination team builds on this through structured deals with clients. Overall, while there are numerous different teams at EDF Trading, they all share similar skillsets and goals, making them ultimately interconnected.",
      "Why do you want to work for EDF Trading?": "I am attracted to EDF Trading due to its strong specialisation in wholesale energy markets, as well as its renewable energy solutions. Due to EDF Trading’s asset-backed nature, it has the necessary infrastructure to allow for excellence in its trading. Moreover, it is a leading player in the European power market, owning the rights to use all major interconnectors across the entirety of Europe. This gives EDF Trading an unprecedented advantage compared to other firms. Finally, I also value EDF Trading’s commitment to sustainability, offering environmental products like EU Allowances, Clean Development Mechanism credits, and more. In particular, EDF Trading schedules and manages over 2,800 MW of wind and solar generation, contributing to renewable generation in Europe. Renewables are the future, and I aspire to be part of this transition. Ultimately, I want to work for a firm that is both excellent and committed to the future, which is why I am interested in EDF Trading.",
      "What is it about this Internship position that stands out for you?": "This internship stands out to me due to its supportive nature and encouragement of exploration of different interests. The constant check-ins and coaching from senior employees create a nurturing environment that catalyses early-career growth. At the same time, it also pushes for self-independence by assigning hands-on projects for interns to work on. I find this a perfect balance of both support and autonomy, allowing for optimal growth. Moreover, the diverse range of opportunities available for students is appealing, as it allows juniors to explore their passions and determine the career path most suitable for them. This is an internship that truly aims to spark long-term growth in students, which is why I am interested in EDF Trading’s Commercial Summer Internship."
    },
    {
      "User": "24",
      "University": "Kent, University of",
      "Course": "Business",
      "What is your understanding of this role based on the job description?": "I understand this internship as an opportunity to be immersed in the energy markets and contribute to meaningful projects across trading, risk, analytics, and origination. What excites me most is the combination of developing both technical and commercial insight within a fast-moving, global environment, while learning directly from EDFT’s specialists. The structured training and mentoring, together with the chance to present to senior leaders, makes this programme a unique platform to strengthen my skills, expand my professional network, and take the first step towards a long-term career in the energy sector.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it offers the chance to be part of a dynamic, fast-moving industry while contributing to the transition towards low-carbon energy. What excites me most about the internship is the blend of practical experience and professional growth it provides. From contributing to a real business project and receiving industry-specific training to building a global network and engaging directly with commercial teams and leaders. This combination of challenge, learning, and exposure makes EDFT the ideal place for me to apply my skills, gain fresh perspectives, and take the first step towards a long-term career in energy markets.",
      "What is it about this Internship position that stands out for you?": "What stands out to me about this internship is the opportunity to experience the energy markets from the inside while being supported to grow. I like that it’s not just about learning technical skills but also about developing personally through training, mentoring, and presenting to senior leaders. The mix of practical involvement in a business project and the chance to build a network across a global organisation makes this internship feel genuinely unique. The emphasis on collaboration, diversity, and professional growth makes it a place where I can not only apply my skills but also develop them further in an environment that values curiosity and initiative."
    },
    {
      "User": "25",
      "University": "Nottingham Trent University",
      "Course": "Business",
      "What is your understanding of this role based on the job description?": "My understanding is that this internship offers hands-on exposure to EDF Trading’s commercial activities across energy commodities, from power and gas trading to market risk, analytics, quant risk, and origination. It is designed to give interns practical involvement in real business projects within a fast-paced trading environment, while also providing structured training in both technical and professional skills.\nThe role also emphasises learning through collaboration with regular opportunities to interact with commercial teams, managers, and mentors, as well as building a global network. The programme finishes with a presentation to senior leaders, reflecting the high level of responsibility interns are given. I see it as both a learning experience and a platform to contribute meaningfully",
      "Why do you want to work for EDF Trading?": "I want to work at EDF Trading because it combines two areas I am passionate about global markets and the energy transition. EDFT’s position at the forefront of European power and gas markets, backed by the EDF group’s low-carbon leadership, makes it an exciting place to learn how trading directly supports the shift to sustainable energy.\nMy experiences at Nationwide and HSBC gave me insight into client-focused financial services, while running my own business has strengthened my commercial awareness, analytical skills, and ability to act under pressure. I am particularly drawn to EDFT’s collaborative culture, where innovation and diversity are encouraged, and I would be eager to contribute while developing into a future energy markets professional.",
      "What is it about this Internship position that stands out for you?": "What stands out to me about the EDF Trading Commercial Summer Internship is the unique combination of hands-on experience, professional development, and exposure to the fast-paced energy markets. I’m particularly drawn to the opportunity to participate in real business projects across trading, risk, and analytics, which would allow me to apply my quantitative and analytical skills in a practical setting."
    },
    {
      "User": "26",
      "University": "Cardiff University",
      "Course": "Business",
      "What is your understanding of this role based on the job description?": "I understand that the Commercial Summer Internship at EDF Trading is a 10-week programme designed to give students like myself real, hands-on exposure to the fast-paced and dynamic world of energy trading. The internship offers the opportunity to work within one of several key commercial teams, such as Trading, Analytics, Risk, Strategy, or Origination and to directly contribute to live projects that help inform high-stakes commercial decisions.\nFrom what I’ve learned, the role goes beyond observation and it's immersive. Interns are treated as valued members of the team, and we’re expected to engage with data, research, and decision-making processes that impact EDF’s trading strategies and business operations across global energy markets.\nThe internship places a strong emphasis on structured training, mentorship, and professional development, including the chance to present work to senior leaders or even members of the C-Suite. I’d be supported in learning about energy commodities, market dynamics, and risk management, while also gaining commercial awareness and understanding the bigger picture of how EDF Trading helps deliver a secure, sustainable and low-carbon energy future.",
      "Why do you want to work for EDF Trading?": "I am eager to dive into the heart of the energy sector, I'm driven by the opportunity to contribute to a forward‑thinking organisation that’s shaping a cleaner, low‑emission, electric future.\nEDF Trading’s reputation as a high‑performing, diverse, and collaborative team resonates deeply with me. I’m drawn to your culture that embraces innovation, flexibility, and respect, empowering individuals to speak up, be heard, and unlock their full potential \n\nThis environment aligns with my belief that when together we crack the most complex challenges, we can make meaningful impact not just for customers and communities, but for the energy industry itself \nEDF UK. I’m particularly inspired by EDF’s commitment to Zero Harm and rigorous risk management - values I uphold in all aspects of work. I'm keen to bring my analytical mindset, commercial acumen, and curiosity to the fast‑paced world of energy commodities trading, where adaptability and creative problem-solving are essential",
      "What is it about this Internship position that stands out for you?": "What stands out to me about this internship is the rare chance to gain exposure to the commercial side of the energy industry at the heart of a global trading business. EDF Trading operates across international energy markets including power, gas, LNG, and environmental products which makes this internship far more than just a UK-based learning experience. It’s a window into how global commodities are priced, managed, and traded in real time.\nWhat also stood out is that this isn’t a “one-size-fits-all” internship. Instead of being placed in a generic role, there’s the opportunity to work within specific commercial teams depending on your strengths and interests — whether that’s Analytics, Market Risk, Quant Trading, or Strategy. I find that really exciting because it means the experience will be both tailored and impactful, and I’ll be able to explore what genuinely suits me.\nI also appreciate the fact that EDF Trading places strong emphasis on intellectual curiosity and encourages interns to ask questions, challenge ideas, and get involved in meaningful discussions even at a junior level. That level of trust and support really appeals to me, especially as someone who thrives when learning through real-world challenges.\nFinally, I value that this internship is not just about learning technical skills, but about understanding how commercial thinking, risk awareness, and data-driven decisions all come together to drive value in a sustainable energy business. That bigger picture is what really sets this opportunity apart for me."
    },
    {
      "User": "27",
      "University": "Southampton, University of",
      "Course": "Finance",
      "What is your understanding of this role based on the job description?": "With respect to this role, its interpretation is that it offers an active and dynamic opportunity to gain firsthand experience in the commercial and analytical functions of a new energy trading firm. The internship is positioned to get the participants used to the frenzied and mentally demanding environment of energy commodities trading, market and quantitative risk, analytics, and origination. It goes beyond observational learning by placing interns directly into real business projects, allowing us to contribute meaningfully while developing technical and professional skills.\nThe program aims to provide comprehensive training industry-specific to the energy trading industry, along with personal development support through mentorship and ongoing feedback. I understand that interns will work closely with commercial teams and senior leaders and develop a comprehensive business understanding by building a global network.",
      "Why do you want to work for EDF Trading?": "I am drawn to EDF Trading because it is a dynamic, forward-thinking energy trading organisation that combines deep market expertise with a sharp focus on innovation and sustainability. As part of the EDF Group - the world's largest electricity generator and a global leader in low-carbon energy, EDF Trading offers the unusual opportunity to contribute to the transition to cleaner energy while operating at the cutting edge of global commodity markets.\n\nEDF Trading’s commitment to developing talent through structured training, mentorship, and real-world exposure makes it an ideal place to launch a career in energy trading. I’m eager to be part of a team that challenges conventional thinking, embraces complexity, and responds swiftly to market opportunities, all while driving sustainable impact.",
      "What is it about this Internship position that stands out for you?": "What strikes me most about this internship is its unique combination of real-world impact, structured development, and senior leadership exposure at a highly respected energy trading firm. Getting to work on real business projects, not just shadow or observe, suggests an organization that values fresh thinking and provides interns actual room to make a tangible difference.\n\n\nFinally, the chance to pitch to the C-Suite later in the program is exhilarating and uplifting. It shows that EDF Trading has faith in exposure and promotion for its interns and that it attests to the potential entry point into the Commercial Graduate Program."
    },
    {
      "User": "28",
      "University": "University College London",
      "Course": "Mathematics/Statistics",
      "What is your understanding of this role based on the job description?": "Based on the job description I can see that the role involves a variety of  different tasks. For instance, theres the trading side of things which could involve going in and out of positions and then there is the quantitative side of things which involves using mathematics and computer science in order to understand data. This will tie into the trading side of things as it will help the traders make their decisions instead of guessing. The role also involves the whole notion of risk management.",
      "Why do you want to work for EDF Trading?": "With a background in financial mathematics, I am drawn to EDF trading because it offers the ideal environment in order to apply my quantitative and analytical skills in a fast paced, real-world setting. EDF trading stands out to me because it combines commercial energy trading with deep quantitative analysis, particularly in areas like market risk, and data driven strategy. Beyond the technical side of things I am excited by EDFT's emphasis on learning while doing. This is a principle I stand by as I believe getting real life experience is the best way to actually get better at a skill rather than just consuming information.",
      "What is it about this Internship position that stands out for you?": "I am mainly drawn to the fact that this internship is not just a typical trading internship but an internship that combines the world of trading with mathematics and data. This means I will get the opportunity to learn about the field I am interested in whilst also utilising my academic skill set. I am also drawn to the opportunity to network with other professional traders who will be able to provide me a learning experience I could not get anywhere else. I also look forward to the opportunity to potentially get a spot on the 2 year graduate programme as that would mean I get to work at such a renowned firm for longer and that my effort in the internship ( if good enough ) would not go unnoticed by the firm."
    },
    {
      "User": "29",
      "University": "King's College London",
      "Course": "Finance",
      "What is your understanding of this role based on the job description?": "This internship is an opportunity to gain practical experience in the energy sector, working on projects that require analysis, problem-solving, and market understanding. Interns collaborate with experienced teams, learning how commercial decisions are made and how energy markets operate. The programme also focuses on professional growth through mentorship, skill development, and networking. It is designed for motivated students who want to build both technical and commercial skills in a dynamic, fast-moving environment.",
      "Why do you want to work for EDF Trading?": "I am drawn to EDF Trading because it operates at the forefront of the European energy markets, combining physical and financial expertise in a way that creates real commercial impact. The company’s focus on innovation, sustainability, and low-carbon energy aligns with my interest in industries that are both dynamic and socially meaningful. I am also attracted to the collaborative and high-performing culture, where learning from experienced professionals and being challenged in a fast-paced environment is encouraged. This internship offers the opportunity to apply analytical skills, develop commercial awareness, and gain hands-on experience in energy trading - all of which match my career ambitions.",
      "What is it about this Internship position that stands out for you?": "What stands out most about this internship is the opportunity to work on real projects that have a tangible impact on energy markets, rather than just observing or completing theoretical tasks. I am particularly drawn to the combination of technical and commercial exposure, where analytical skills are applied alongside decision-making in a fast-paced, real-world environment. Overall, it offers a unique chance to gain a deep understanding of energy trading while building the skills needed for a future career in the sector."
    },
    {
      "User": "30",
      "University": "Cardiff University",
      "Course": "Business",
      "What is your understanding of this role based on the job description?": "From my understanding, this internship is designed to provide students with a real insight into the world of energy trading, offering opportunities across trading, risk, analytics, and origination. What excites me is that it isn’t just about observing but actively contributing to projects that support EDF Trading’s commercial activities. The programme combines technical and professional training, mentorship, and networking, while also giving interns exposure to senior stakeholders.\n\nI see this as a chance to apply the skills I’ve developed—particularly in data analysis, financial auditing, and problem-solving—within a high-performing, fast-paced environment. During my placement year at GE Aerospace, I worked on financial audits across multiple sites and used data visualisation tools like Power BI to identify and resolve billing issues worth millions of pounds. Those experiences taught me the importance of analytical precision, commercial awareness, and effective communication—skills that align strongly with the demands of this internship.",
      "Why do you want to work for EDF Trading?": "I want to work for EDF Trading because it operates at the forefront of European energy markets and plays a key role in the global transition towards low-carbon energy. The opportunity to be part of an organisation that combines commercial strength with innovation in such an important industry really motivates me.\n\nAnother reason is the culture you describe. EDFT values diversity, collaboration, and respect—principles I have actively embraced in my own experiences. For example, as Wellbeing Officer for Cardiff Business School Society, I helped grow membership by 25% by creating inclusive events and building partnerships with external organisations. Similarly, while leading teams of up to 25 staff at Manchester Central events, I learned how to motivate diverse groups under pressure while ensuring high standards for customers and clients.\n\nFinally, EDFT’s global reach is very appealing. My volunteering in Sri Lanka showed me the impact of working in international settings and adapting quickly to new environments. I believe EDFT’s international exposure, combined with its focus on sustainability and trading expertise, would be the ideal place to grow both personally and professionally.",
      "What is it about this Internship position that stands out for you?": "What stands out most about this internship is how well-structured and developmental it is. The combination of hands-on project work, skills training, and mentoring really appeals to me, as I enjoy learning by doing and building relationships with people who can challenge and inspire me. Having the opportunity to present directly to senior stakeholders at the end of the programme also excites me—it’s the kind of challenge that pushes me to perform at my best.\n\nI’m also drawn to the variety the internship offers. At GE Aerospace, I thrived in an environment where I had to balance financial analysis with process improvement and cross-functional collaboration, and I enjoyed being able to work across different areas. The fact that EDFT provides exposure not only to trading but also to analytics, risk, and origination makes this internship particularly attractive.\n\nFinally, the clear pathway into the Commercial Graduate Programme makes the internship more than just a summer placement—it feels like the first step in building a meaningful career in the energy markets. That sense of progression and purpose is what really excites me about applying"
    },
    {
      "User": "31",
      "University": "Essex, University of",
      "Course": "Law",
      "What is your understanding of this role based on the job description?": "From the job description, I understand that the Commercial Summer Internship at EDF Trading offers a structured, hands-on opportunity to gain practical experience across the wholesale energy markets, including areas such as energy commodities trading, market risk, analytics, quant risk, and origination. Interns actively contribute to real business projects, while also receiving industry-specific training and mentorship, and the chance to interact with commercial teams and leaders. The programme aims to develop both professional and personal skills, providing exposure to a fast-paced, innovative, and collaborative trading environment. EDFT seeks individuals who are commercially astute, curious, and analytically strong, with an interest in energy markets, critical thinking ability, and quantitative and qualitative skills. Overall, the internship is designed to give interns a deep understanding of the energy industry, develop commercial and analytical expertise, and potentially lead to a place on EDFT’s Commercial Graduate Programme.",
      "Why do you want to work for EDF Trading?": "While working as a Duty Manager at Wilde Aparthotel, I had the opportunity to connect with several people who had worked at EDF. I asked them about their experiences, particularly regarding the company’s culture and approach to teamwork, innovation, and professional development. Everyone spoke highly of EDF’s collaborative and supportive environment, as well as its focus on continuous learning. This really inspired me, as these values resonate strongly with me. I am particularly drawn to EDF Trading because it operates at the forefront of European energy markets, combining commercial expertise with a strong commitment to low-carbon and sustainable solutions. The opportunity to gain hands-on experience in trading, market risk, and analytics in such an innovative and dynamic environment makes EDF the ideal place for me to develop my commercial and analytical skills while contributing to the energy transition.",
      "What is it about this Internship position that stands out for you?": "What is it about this Internship position that stands out for you?\nWhat excites me most about this internship is the opportunity to gain hands-on experience at EDF Trading, a market leader in European power and gas markets, where physical and financial trading is combined to create value for both the EDF Group and third-party clients. I am particularly drawn to the chance to work on real business projects in areas such as trading, market risk, analytics, and origination, while receiving structured mentorship and industry-specific training. Through my research, I’ve been impressed by EDFT’s focus on innovation, sustainability, and low-carbon solutions, as well as its collaborative and inclusive culture. This internship offers a unique opportunity to develop my commercial and analytical skills while gaining insight into how a global energy leader navigates complex, fast-moving markets."
    },
    {
      "User": "32",
      "University": "Surrey, University of",
      "Course": "Economics",
      "What is your understanding of this role based on the job description?": "I understand the internship to be a structured programme offering hands on experience across EDF Trading's commercial functions and energy markets, including trading, analytics, and risk. The role centres on contributing to a real business project while receiving training, mentorship, and exposure to senior leaders.",
      "Why do you want to work for EDF Trading?": "What attracts me most is the chance to work in an environment where data driven analysis, innovation, and adaptability directly shape trading decisions. My experiences, from portfolio optimisation with Fidelity International to equity execution projects in Sales & Trading, have shown me how exciting it is to apply quantitative skills to real time markets. EDFT's emphasis on collaboration, respect, and high performance aligns with how I like to work, and I am motivated by the opportunity to grow within a culture that values curiosity and initiative.",
      "What is it about this Internship position that stands out for you?": "What stands out to me about this internship is the chance to get genuine, practical exposure in a trading environment rather then just shadowing. The idea of working on a real project and seeing how my analysis or models could actually be used is far more valuable then just theory. I also like that the programme offers variety across trading. I'm still early on in my career, so being able to explore different areas like risk and analytics before specialising is a big attraction. Finally, the chance to present to senior leaders and get feedback makes this internship stand out as a place where interns are taken seriously and given real responsibility."
    },
    {
      "User": "33",
      "University": "Goldsmiths, University of London",
      "Course": "Marketing",
      "What is your understanding of this role based on the job description?": "My understanding is that this internship is not just an introduction to EDF Trading, but a high-impact immersion into the commercial engine room of the energy markets. It's designed to place interns in the thick of live projects, whether in trading, analytics, risk, or origination, where critical thinking, curiosity, and adaptability are more than just desirable traits; they’re necessary tools of the trade.\nBeyond the technical exposure, this role offers something increasingly rare in internships: a clear sense of trajectory. The programme blends professional development with real-world accountability, giving interns the chance to contribute meaningfully while learning how global energy markets operate at speed. The end-of-placement presentation to senior leadership underlines EDFT’s commitment to treating interns as future commercial talent, not passive observers.\nIt's also clear that EDFT values both intellect and character, individuals who think deeply, work collaboratively, and aren’t afraid to challenge assumptions in pursuit of better decisions. For someone eager to develop a career at the intersection of data, strategy, and markets, this internship represents an exceptional launchpad.",
      "Why do you want to work for EDF Trading?": "EDF Trading possess a fascinating identity, where energy, data, and global markets converge, and that’s exactly the environment I’m eager to be part of. The company’s role in enabling the transition to low-carbon energy while remaining deeply embedded in fast-moving commodity markets is both commercially ambitious and intellectually exciting.\nWhat stands out most to me is EDFT’s dual identity: a core part of a major global energy group, but with the agility and culture of a high-performing trading firm. That balance of structure and entrepreneurial thinking is rare, and speaks to the kind of environment where I believe I’d learn the most.\nFrom a career perspective, I’m looking to build not just technical skills, but commercial judgment, learning how to interpret markets, work with data, and make decisions in real time. EDFT’s commitment to hands-on learning, strong mentorship, and exposure to senior stakeholders makes it one of the few places where interns are expected to think, speak, and contribute like future professionals, not spectators.",
      "What is it about this Internship position that stands out for you?": "What stands out most is the level of trust and responsibility EDF Trading is prepared to give its interns. The chance to contribute to a real commercial project, not just shadow the work, but actively shape it, is a rare offering. It suggests a culture that sees interns as potential colleagues, not just students passing through.\nI’m also drawn to the breadth of exposure across teams, trading, market risk, analytics, origination, which reflects the complex, interconnected nature of energy markets today. For someone still exploring where their strengths lie within the commercial space, that kind of access is invaluable.\nFinally, the structure of the internship, including mentorship, cross-team interaction, and a final presentation to senior leadership, shows that EDFT has designed this programme with long-term growth in mind. It’s not just about learning the ropes; it’s about stepping up, being challenged, and understanding what it takes to contribute at a high level in a real-world trading environment"
    }
  ],
  "analysis": "### Analysis Results for EDF Trading - Internship (33 applications processed in 1 batches)\n\n### Batch 1 Results:\n### Analysis of Applications\n\nUser 1 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Strong understanding of the role and passion for trading, with a clear alignment to EDF Trading’s values.\n\nUser 2 - Overall Score 13/15 - Q1: 4* Q2: 5* Q3: 4* - Good grasp of the role and clear motivation driven by a sustainable energy vision.\n\nUser 3 - Overall Score 15/15 - Q1: 5* Q2: 5* Q3: 5* - Excellent understanding of the role, demonstrating strong background in economics and hands-on experience.\n\nUser 4 - Overall Score 13/15 - Q1: 4* Q2: 4* Q3: 5* - Good grasp of responsibilities with a focus on training and mentorship opportunities.\n\nUser 5 - Overall Score 14/15 - Q1: 4* Q2: 5* Q3: 5* - Clear understanding of the internship's challenges and strong alignment with EDF Trading’s culture.\n\nUser 6 - Overall Score 3/15 - Q1: 1* Q2: 1* Q3: 1* - Lacks detailed responses to all questions, does not demonstrate understanding.\n\nUser 7 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Strong alignment with EDF Trading’s vision and solid understanding of the role’s demands.\n\nUser 8 - Overall Score 13/15 - Q1: 4* Q2: 4* Q3: 5* - Good understanding of the role and solid motivations, though slightly less detailed.\n\nUser 9 - Overall Score 12/15 - Q1: 4* Q2: 4* Q3: 4* - Solid responses showing good motivation and understanding but lacks a personal touch.\n\nUser 10 - Overall Score 10/15 - Q1: 3* Q2: 4* Q3: 3* - Adequate understanding but lacks depth in responses, particularly in motivation.\n\nUser 11 - Overall Score 13/15 - Q1: 4* Q2: 5* Q3: 4* - Strong alignment with EDF Trading’s goals and clear understanding of the role.\n\nUser 12 - Overall Score 6/15 - Q1: 2* Q2: 2* Q3: 2* - Lacks depth and clarity in understanding the role and motivation.\n\nUser 13 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Excellent articulation of motivation and understanding of the role.\n\nUser 14 - Overall Score 12/15 - Q1: 4* Q2: 4* Q3: 4* - Solid understanding and good motivation, but lacks personal connection.\n\nUser 15 - Overall Score 12/15 - Q1: 4* Q2: 4* Q3: 4* - Strong technical background and clear understanding, but could elaborate more on motivation.\n\nUser 16 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Clear understanding of the role and well-articulated motivations.\n\nUser 17 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Strong analytical background and clear connection to the role’s requirements.\n\nUser 18 - Overall Score 9/15 - Q1: 3* Q2: 3* Q3: 3* - Responses lack depth and specificity, impacting overall impression.\n\nUser 19 - Overall Score 3/15 - Q1: 1* Q2: 1* Q3: 1* - Very minimal responses, showing lack of understanding and motivation.\n\nUser 20 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Strong analytical and commercial insight aligned with EDF Trading’s mission.\n\nUser 21 - Overall Score 13/15 - Q1: 4* Q2: 5* Q3: 4* - Good understanding of the role and clear motivation to join EDF Trading.\n\nUser 22 - Overall Score 11/15 - Q1: 3* Q2: 4* Q3: 4* - Adequate understanding but could improve on motivation specifics.\n\nUser 23 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Strong articulation of motivation and understanding, particularly regarding sustainability.\n\nUser 24 - Overall Score 13/15 - Q1: 4* Q2: 4* Q3: 5* - Good understanding and alignment with EDF Trading’s values.\n\nUser 25 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Strong motivation and understanding of the energy market dynamics.\n\nUser 26 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Clear understanding of the internship structure and strong motivation to contribute meaningfully.\n\nUser 27 - Overall Score 12/15 - Q1: 4* Q2: 4* Q3: 4* - Adequate understanding and motivation, but could use more specific examples.\n\nUser 28 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Strong motivation and understanding of the role’s analytical aspects.\n\nUser 29 - Overall Score 13/15 - Q1: 4* Q2: 4* Q3: 5* - Good grasp of the role with strong analytical skills and motivation.\n\nUser 30 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Strong understanding and motivation for the energy transition.\n\nUser 31 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Excellent understanding of EDF Trading’s operations and clear motivation to join.\n\nUser 32 - Overall Score 13/15 - Q1: 4* Q2: 4* Q3: 5* - Solid understanding and good motivation for the internship.\n\nUser 33 - Overall Score 14/15 - Q1: 5* Q2: 5* Q3: 4* - Strong understanding of the role with clear motivation to engage in meaningful projects.\n\n---\n\n### DETAILED REASONING:\n\nUser 1: Scored highly for articulating an excellent understanding of the role and showing strong motivation towards EDF Trading’s mission, particularly in energy trading and analytics.\n\nUser 2: Demonstrated a solid understanding of the role's responsibilities and conveyed a strong passion for sustainable energy, though slightly less detailed than User 1.\n\nUser 3: Provided clear, well-structured insights into the role, showcasing previous experiences that directly align with the internship's demands, scoring the highest.\n\nUser 4: Solid understanding but slightly less passion than top candidates; stood out with the mention of structured training opportunities.\n\nUser 5: Strong responses reflecting an understanding of the role’s challenges and alignment with EDF Trading’s values, albeit without extensive personal detail.\n\nUser 6: Lacked specificity in all answers, leading to a low score; minimal understanding of the role and lack of motivation.\n\nUser 7: Strong alignment with company values and good understanding of responsibilities; confident in showcasing related experiences.\n\nUser 8: Good understanding, but slightly generic responses; motivation was clear but not as compelling as higher-scoring candidates.\n\nUser 9: Strong motivation and understanding but lacked personal connection; responses felt somewhat formulaic.\n\nUser 10: Adequate understanding but lacked depth; motivation could be stronger with more personal examples.\n\nUser 11: Good alignment with the company’s goals and understanding of the role; responses were clear and structured.\n\nUser 12: Lacked depth and clarity in understanding the role and motivation; responses felt vague and non-specific.\n\nUser 13: Excellent articulation of motivation and understanding; experiences shared were relevant and compelling.\n\nUser 14: Solid understanding with good motivation; however, responses could have been more personalized.\n\nUser 15: Strong technical background and understanding; motivation was clear but could use more personal connection.\n\nUser 16: Clear understanding of the role and motivations; strong responses but slightly less personal engagement.\n\nUser 17: Strong analytical skills and alignment with the role; responses conveyed a clear understanding of the energy trading environment.\n\nUser 18: Responses lacked depth and specificity, leading to a lower score.\n\nUser 19: Very limited responses indicated a lack of understanding and motivation, resulting in a low score.\n\nUser 20: Strong analytical and commercial insight; responses conveyed a clear understanding of the role.\n\nUser 21: Good understanding of the role and strong motivation; responses were clear and relevant.\n\nUser 22: Adequate understanding but could improve on motivation specifics; responses felt somewhat generic.\n\nUser 23: Strong articulation of motivation and understanding; particularly regarding sustainability; responses were compelling.\n\nUser 24: Good understanding and alignment with EDF Trading’s values; responses were clear and well-structured.\n\nUser 25: Strong motivation and understanding of the energy market dynamics; responses were thoughtful and relevant.\n\nUser 26: Clear understanding and motivation for the energy transition; responses were strong and conveyed enthusiasm.\n\nUser 27: Adequate understanding and motivation; responses were clear but could use more specific examples.\n\nUser 28: Strong motivation and understanding of the analytical aspects of the role; responses were well-articulated.\n\nUser 29: Good grasp of the role with strong analytical skills; motivation was clear but could use more personal connection.\n\nUser 30: Strong understanding and motivation for the energy transition; responses were thoughtful and relevant.\n\nUser 31: Excellent understanding of EDF Trading’s operations and clear motivation to join; responses were compelling.\n\nUser 32: Solid understanding and good motivation for the internship; responses were structured and relevant.\n\nUser 33: Strong understanding of the role with clear motivation; responses were articulate and insightful.\n\n---\n\n### Summary:\nThe applications show a wide range of understanding and motivation levels, with candidates like User 3 and User 1 standing out for their exceptional insights and alignment with EDF Trading’s mission. In contrast, Users 6 and 19 struggled to provide compelling responses, impacting their overall scores.\n\n",
  "timestamp": "{\"timestamp\": \"2025-01-17T14:00:00Z\"}"
}